{
  "Shared-State Concurrency": {
    "_translate": "<a class=\"header\" href=\"#shared-state-concurrency\">共享状态并发</a>",
    "_note": ""
  },
  "Message passing is a fine way of handling concurrency, but it’s not the only one. Another method would be for multiple threads to access the same shared data. Consider this part of the slogan from the Go language documentation again: “do not communicate by sharing memory.”": {
    "_translate": "消息传递是处理并发的一种好方法，但并不是唯一的方法。另一种方法是多个线程访问相同的共享数据。再次考虑 Go 语言文档中的这句口号：“不要通过共享内存来通信。”",
    "_note": ""
  },
  "What would communicating by sharing memory look like? In addition, why would message-passing enthusiasts caution not to use memory sharing?": {
    "_translate": "共享内存进行通信会是什么样子？此外，为什么消息传递的支持者会警告不要使用内存共享？",
    "_note": ""
  },
  "Using Mutexes to Allow Access to Data from One Thread at a Time": {
    "_translate": "<a class=\"header\" href=\"#using-mutexes-to-allow-access-to-data-from-one-thread-at-a-time\">使用 Mutex 允许一次只有一个线程访问数据</a>",
    "_note": ""
  },
  "In a way, channels in any programming language are similar to single ownership, because once you transfer a value down a channel, you should no longer use that value. Shared memory concurrency is like multiple ownership: multiple threads can access the same memory location at the same time. As you saw in Chapter 15, where smart pointers made multiple ownership possible, multiple ownership can add complexity because these different owners need managing. Rust’s type system and ownership rules greatly assist in getting this management correct. For an example, let’s look at mutexes, one of the more common concurrency primitives for shared memory.": {
    "_translate": "在某种程度上，任何编程语言中的通道都类似于单一所有权，因为一旦你通过通道传递一个值，你就不再应该使用该值。共享内存并发类似于多重所有权：多个线程可以同时访问同一内存位置。正如你在第 15 章中看到的，智能指针使得多重所有权成为可能，多重所有权可以增加复杂性，因为这些不同的所有者需要管理。Rust 的类型系统和所有权规则在正确管理这些所有者方面提供了很大帮助。作为一个例子，让我们看看互斥锁，这是共享内存中最常见的并发原语之一。",
    "_note": ""
  },
  "Mutexes have a reputation for being difficult to use because you have to remember two rules:": {
    "_translate": "Mutexes 有 Reputation 为难以使用，因为您必须记住两条规则：",
    "_note": ""
  },
  "Mutex is an abbreviation for mutual exclusion, as in, a mutex allows only one thread to access some data at any given time. To access the data in a mutex, a thread must first signal that it wants access by asking to acquire the mutex’s lock. The lock is a data structure that is part of the mutex that keeps track of who currently has exclusive access to the data. Therefore, the mutex is described as guarding the data it holds via the locking system.": {
    "_translate": "<em>Mutex</em> 是 <em>互斥</em> 的缩写，也就是说，一个 mutex 只允许一个线程在任何时候访问某些数据。要访问 mutex 中的数据，线程必须首先通过请求获取 mutex 的 <em>锁</em> 来表明它希望访问。锁是 mutex 的一部分，是一个跟踪谁当前拥有数据独占访问权的数据结构。因此，mutex 通过锁定系统 <em>保护</em> 它持有的数据。",
    "_note": ""
  },
  "Management of mutexes can be incredibly tricky to get right, which is why so many people are enthusiastic about channels. However, thanks to Rust’s type system and ownership rules, you can’t get locking and unlocking wrong.": {
    "_translate": "管理互斥锁可能非常棘手，这就是为什么那么多人对通道充满热情。然而，得益于 Rust 的类型系统和所有权规则，你不会把加锁和解锁弄错。",
    "_note": ""
  },
  "As an example of how to use a mutex, let’s start by using a mutex in a single-threaded context, as shown in Listing 16-12:": {
    "_translate": "作为如何使用互斥锁的一个示例，让我们先在一个单线程环境中使用互斥锁，如清单 16-12 所示：",
    "_note": ""
  },
  "For a real-world metaphor for a mutex, imagine a panel discussion at a conference with only one microphone. Before a panelist can speak, they have to ask or signal that they want to use the microphone. When they get the microphone, they can talk for as long as they want to and then hand the microphone to the next panelist who requests to speak. If a panelist forgets to hand the microphone off when they’re finished with it, no one else is able to speak. If management of the shared microphone goes wrong, the panel won’t work as planned!": {
    "_translate": "为了将互斥锁比喻成现实生活中的例子，想象一下在会议上的一个小组讨论，只有一个麦克风。在小组成员可以发言之前，他们必须请求或示意他们想要使用麦克风。当他们拿到麦克风时，他们可以随心所欲地讲话，然后将麦克风交给下一个请求发言的小组成员。如果一个小组成员在完成发言后忘记传递麦克风，其他人就无法发言。如果共享麦克风的管理出现问题，小组讨论将无法按计划进行！",
    "_note": ""
  },
  "As with many types, we create a Mutex<T> using the associated function new. To access the data inside the mutex, we use the lock method to acquire the lock. This call will block the current thread so it can’t do any work until it’s our turn to have the lock.": {
    "_translate": "与许多类型一样，我们使用关联函数 <code>new</code> 创建一个 <code>Mutex&lt;T&gt;</code>。\n要访问互斥锁中的数据，我们使用 <code>lock</code> 方法来获取锁。此调用将阻塞当前线程，直到轮到我们拥有锁为止。",
    "_note": ""
  },
  "The call to lock would fail if another thread holding the lock panicked. In that case, no one would ever be able to get the lock, so we’ve chosen to unwrap and have this thread panic if we’re in that situation.": {
    "_translate": "调用 <code>lock</code> 会在另一个线程持有锁时发生恐慌而失败。在这种情况下，将没有人能够获取锁，所以我们选择 <code>unwrap</code>，如果我们在那种情况下，让这个线程发生恐慌。",
    "_note": ""
  },
  "After we’ve acquired the lock, we can treat the return value, named num in this case, as a mutable reference to the data inside. The type system ensures that we acquire a lock before using the value in m. The type of m is Mutex<i32>, not i32, so we must call lock to be able to use the i32 value. We can’t forget; the type system won’t let us access the inner i32 otherwise.": {
    "_translate": "在获取锁之后，我们可以将返回值（在这个例子中命名为<code>num</code>）视为对内部数据的可变引用。类型系统确保我们在使用<code>m</code>中的值之前获取锁。<code>m</code>的类型是<code>Mutex&lt;i32&gt;</code>，而不是<code>i32</code>，所以我们<em>必须</em>调用<code>lock</code>才能使用<code>i32</code>值。我们不能忘记；类型系统不会让我们以其他方式访问内部的<code>i32</code>。",
    "_note": ""
  },
  "As you might suspect, Mutex<T> is a smart pointer. More accurately, the call to lock returns a smart pointer called MutexGuard, wrapped in a LockResult that we handled with the call to unwrap. The MutexGuard smart pointer implements Deref to point at our inner data; the smart pointer also has a Drop implementation that releases the lock automatically when a MutexGuard goes out of scope, which happens at the end of the inner scope. As a result, we don’t risk forgetting to release the lock and blocking the mutex from being used by other threads, because the lock release happens automatically.": {
    "_translate": "正如你可能猜到的，<code>Mutex&lt;T&gt;</code> 是一个智能指针。更准确地说，对 <code>lock</code> 的调用 <em>返回</em> 一个名为 <code>MutexGuard</code> 的智能指针，该指针被包装在一个我们通过调用 <code>unwrap</code> 处理的 <code>LockResult</code> 中。<code>MutexGuard</code> 智能指针实现了 <code>Deref</code> 以指向我们的内部数据；该智能指针还具有一个 <code>Drop</code> 实现，当 <code>MutexGuard</code> 超出作用域时会自动释放锁，这发生在内部作用域结束时。因此，我们不会忘记释放锁，从而阻止其他线程使用互斥锁，因为锁的释放是自动进行的。",
    "_note": ""
  },
  "After dropping the lock, we can print the mutex value and see that we were able to change the inner i32 to 6.": {
    "_translate": "释放锁后，我们可以打印互斥锁的值并看到我们能够将内部<code>i32</code>更改为6。",
    "_note": ""
  },
  "Now, let’s try to share a value between multiple threads using Mutex<T>. We’ll spin up 10 threads and have them each increment a counter value by 1, so the counter goes from 0 to 10. The next example in Listing 16-13 will have a compiler error, and we’ll use that error to learn more about using Mutex<T> and how Rust helps us use it correctly.": {
    "_translate": "现在，让我们尝试使用<code>Mutex&lt;T&gt;</code>在多个线程之间共享一个值。\n我们将启动10个线程，让它们各自将计数器值加1，从而使计数器从0增加到10。列表16-13中的下一个示例将出现编译器错误，我们将利用该错误来更多地了解使用<code>Mutex&lt;T&gt;</code>以及Rust如何帮助我们正确使用它。",
    "_note": ""
  },
  "In the main thread, we collect all the join handles. Then, as we did in Listing 16-2, we call join on each handle to make sure all the threads finish. At that point, the main thread will acquire the lock and print the result of this program.": {
    "_translate": "在主线程中，我们收集所有的 join 句柄。然后，像我们在清单 16-2 中所做的那样，我们对每个句柄调用 <code>join</code> 以确保所有线程都完成。在那之后，主线程将获取锁并打印此程序的结果。",
    "_note": ""
  },
  "We create a counter variable to hold an i32 inside a Mutex<T>, as we did in Listing 16-12. Next, we create 10 threads by iterating over a range of numbers. We use thread::spawn and give all the threads the same closure: one that moves the counter into the thread, acquires a lock on the Mutex<T> by calling the lock method, and then adds 1 to the value in the mutex. When a thread finishes running its closure, num will go out of scope and release the lock so another thread can acquire it.": {
    "_translate": "我们创建一个 <code>counter</code> 变量来在 <code>Mutex&lt;T&gt;</code> 中保存一个 <code>i32</code>，就像我们在清单 16-12 中所做的那样。接下来，我们通过遍历一个数字范围来创建 10 个线程。我们使用 <code>thread::spawn</code> 并给所有线程相同的闭包：一个将计数器移动到线程中，通过调用 <code>lock</code> 方法获取 <code>Mutex&lt;T&gt;</code> 的锁，然后将互斥锁中的值加 1。当线程完成运行其闭包时，<code>num</code> 将超出作用域并释放锁，以便其他线程可以获取它。",
    "_note": ""
  },
  "We hinted that this example wouldn’t compile. Now let’s find out why!": {
    "_translate": "我们暗示过这个例子无法编译。现在让我们找出原因！",
    "_note": ""
  },
  "The error message states that the counter value was moved in the previous iteration of the loop. Rust is telling us that we can’t move the ownership of counter into multiple threads. Let’s fix the compiler error with a multiple-ownership method we discussed in Chapter 15.": {
    "_translate": "错误消息指出 <code>counter</code> 的值在循环的前一次迭代中被移动了。Rust 告诉我们不能将 <code>counter</code> 的所有权移动到多个线程中。让我们用我们在第 15 章讨论的多所有权方法来修复编译器错误。",
    "_note": ""
  },
  "In Chapter 15, we gave a value multiple owners by using the smart pointer Rc<T> to create a reference counted value. Let’s do the same here and see what happens. We’ll wrap the Mutex<T> in Rc<T> in Listing 16-14 and clone the Rc<T> before moving ownership to the thread.": {
    "_translate": "在第 15 章中，我们通过使用智能指针 <code>Rc&lt;T&gt;</code> 创建引用计数的值来为一个值赋予多个所有者。让我们在这里做同样的事情，看看会发生什么。我们将在清单 16-14 中将 <code>Mutex&lt;T&gt;</code> 包装在 <code>Rc&lt;T&gt;</code> 中，并在将所有权移动到线程之前克隆 <code>Rc&lt;T&gt;</code>。",
    "_note": ""
  },
  "Once again, we compile and get… different errors! The compiler is teaching us a lot.": {
    "_translate": "再一次，我们编译并得到……不同的错误！编译器正在教我们很多。",
    "_note": ""
  },
  "Wow, that error message is very wordy! Here’s the important part to focus on: `Rc<Mutex<i32>>` cannot be sent between threads safely. The compiler is also telling us the reason why: the trait `Send` is not implemented for `Rc<Mutex<i32>>` . We’ll talk about Send in the next section: it’s one of the traits that ensures the types we use with threads are meant for use in concurrent situations.": {
    "_translate": "哇，那个错误信息非常冗长！这里是要关注的重要部分：\n<code>`Rc&lt;Mutex&lt;i32&gt;&gt;` 不能在线程间安全地传递</code>。编译器还告诉了我们原因： <code>`Rc&lt;Mutex&lt;i32&gt;&gt;` 没有实现 `Send` 特性</code>。我们将在下一节讨论 <code>Send</code>：它是确保我们在线程中使用的类型适用于并发情况的特性之一。",
    "_note": ""
  },
  "Unfortunately, Rc<T> is not safe to share across threads. When Rc<T> manages the reference count, it adds to the count for each call to clone and subtracts from the count when each clone is dropped. But it doesn’t use any concurrency primitives to make sure that changes to the count can’t be interrupted by another thread. This could lead to wrong counts—subtle bugs that could in turn lead to memory leaks or a value being dropped before we’re done with it. What we need is a type exactly like Rc<T> but one that makes changes to the reference count in a thread-safe way.": {
    "_translate": "不幸的是，<code>Rc&lt;T&gt;</code> 不能安全地在多个线程间共享。当 <code>Rc&lt;T&gt;</code>\n管理引用计数时，它会在每次调用 <code>clone</code> 时增加计数，并在每个克隆被销毁时减少计数。但它没有使用任何\n并发原语来确保计数的更改不会被另一个线程中断。这可能会导致计数错误——细微的错误可能会导致内存泄漏或在我们尚未完成使用某个值时将其销毁。我们需要一个类型，就像 <code>Rc&lt;T&gt;</code> 一样，但能够以线程安全的方式更改引用计数。",
    "_note": ""
  },
  "You might then wonder why all primitive types aren’t atomic and why standard library types aren’t implemented to use Arc<T> by default. The reason is that thread safety comes with a performance penalty that you only want to pay when you really need to. If you’re just performing operations on values within a single thread, your code can run faster if it doesn’t have to enforce the guarantees atomics provide.": {
    "_translate": "你可能会想知道为什么所有原始类型都不是原子的，为什么标准库类型默认没有实现使用<code>Arc&lt;T&gt;</code>。原因是线程安全会带来性能开销，你只在真正需要时才愿意承担。如果你只是在单个线程内对值进行操作，你的代码在不需要强制执行原子性提供的保证时可以运行得更快。",
    "_note": ""
  },
  "Fortunately, Arc<T> is a type like Rc<T> that is safe to use in concurrent situations. The a stands for atomic, meaning it’s an atomically reference counted type. Atomics are an additional kind of concurrency primitive that we won’t cover in detail here: see the standard library documentation for std::sync::atomic for more details. At this point, you just need to know that atomics work like primitive types but are safe to share across threads.": {
    "_translate": "Fortunately, <code>Arc&lt;T&gt;</code> <em>是</em> 一个像 <code>Rc&lt;T&gt;</code> 一样的类型，可以在并发情况下安全使用。<em>a</em> 代表 <em>原子</em>，意味着它是一个 <em>原子引用计数</em> 类型。原子是另一种并发原语，我们在这里不会详细讨论：有关更多详细信息，请参阅标准库文档 <a href=\"../std/sync/atomic/index.html\"><code>std::sync::atomic</code></a><!-- ignore -->。目前，你只需要知道原子像基本类型一样工作，但可以在线程间安全共享。",
    "_note": ""
  },
  "This code will print the following:": {
    "_translate": "这段代码将打印以下内容：",
    "_note": ""
  },
  "Let’s return to our example: Arc<T> and Rc<T> have the same API, so we fix our program by changing the use line, the call to new, and the call to clone. The code in Listing 16-15 will finally compile and run:": {
    "_translate": "让我们回到我们的例子：<code>Arc&lt;T&gt;</code> 和 <code>Rc&lt;T&gt;</code> 有相同的 API，所以我们通过更改 <code>use</code> 行、对 <code>new</code> 的调用以及对 <code>clone</code> 的调用来修复我们的程序。清单 16-15 中的代码最终将编译并运行：",
    "_note": ""
  },
  "We did it! We counted from 0 to 10, which may not seem very impressive, but it did teach us a lot about Mutex<T> and thread safety. You could also use this program’s structure to do more complicated operations than just incrementing a counter. Using this strategy, you can divide a calculation into independent parts, split those parts across threads, and then use a Mutex<T> to have each thread update the final result with its part.": {
    "_translate": "我们做到了！我们从0数到了10，这可能看起来并不太了不起，但这确实让我们学到了很多关于<code>Mutex&lt;T&gt;</code>和线程安全的知识。你也可以利用这个程序的结构来执行比简单递增计数器更复杂的操作。使用这种策略，你可以将计算分解为独立的部分，将这些部分分配到不同的线程上，然后使用<code>Mutex&lt;T&gt;</code>让每个线程用其部分结果更新最终结果。",
    "_note": ""
  },
  "Note that if you are doing simple numerical operations, there are types simpler than Mutex<T> types provided by the std::sync::atomic module of the standard library. These types provide safe, concurrent, atomic access to primitive types. We chose to use Mutex<T> with a primitive type for this example so we could concentrate on how Mutex<T> works.": {
    "_translate": "请注意，如果您正在进行简单的数值操作，标准库的<a href=\"../std/sync/atomic/index.html\"><code>std::sync::atomic</code> 模块</a>提供了比<code>Mutex&lt;T&gt;</code>更简单的类型<!-- ignore -->。这些类型提供了对基本类型的线程安全、并发、原子访问。我们在这个例子中选择使用带有基本类型的<code>Mutex&lt;T&gt;</code>，以便集中讲解<code>Mutex&lt;T&gt;</code>的工作原理。",
    "_note": ""
  },
  "Similarities Between RefCell<T>/Rc<T> and Mutex<T>/Arc<T>": {
    "_translate": "<a class=\"header\" href=\"#similarities-between-refcelltrct-and-mutextarct\">RefCell<T>/Rc<T> 和 Mutex<T>/Arc<T> 之间的相似性</a>",
    "_note": ""
  },
  "You might have noticed that counter is immutable but we could get a mutable reference to the value inside it; this means Mutex<T> provides interior mutability, as the Cell family does. In the same way we used RefCell<T> in Chapter 15 to allow us to mutate contents inside an Rc<T>, we use Mutex<T> to mutate contents inside an Arc<T>.": {
    "_translate": "你可能已经注意到 <code>counter</code> 是不可变的，但我们能够获取其内部值的可变引用；这意味着 <code>Mutex&lt;T&gt;</code> 提供了内部可变性，就像 <code>Cell</code> 系列一样。同样地，我们在第 15 章中使用 <code>RefCell&lt;T&gt;</code> 允许我们修改 <code>Rc&lt;T&gt;</code> 内部的内容，我们使用 <code>Mutex&lt;T&gt;</code> 来修改 <code>Arc&lt;T&gt;</code> 内部的内容。",
    "_note": ""
  },
  "We’ll round out this chapter by talking about the Send and Sync traits and how we can use them with custom types.": {
    "_translate": "我们将通过讨论 <code>Send</code> 和 <code>Sync</code> 特性以及如何将它们与自定义类型一起使用来结束本章。",
    "_note": ""
  },
  "Another detail to note is that Rust can’t protect you from all kinds of logic errors when you use Mutex<T>. Recall in Chapter 15 that using Rc<T> came with the risk of creating reference cycles, where two Rc<T> values refer to each other, causing memory leaks. Similarly, Mutex<T> comes with the risk of creating deadlocks. These occur when an operation needs to lock two resources and two threads have each acquired one of the locks, causing them to wait for each other forever. If you’re interested in deadlocks, try creating a Rust program that has a deadlock; then research deadlock mitigation strategies for mutexes in any language and have a go at implementing them in Rust. The standard library API documentation for Mutex<T> and MutexGuard offers useful information.": {
    "_translate": "另一个需要注意的细节是，Rust 不能保护你免受所有类型的逻辑错误，当你使用 <code>Mutex&lt;T&gt;</code> 时。回想第 15 章，使用 <code>Rc&lt;T&gt;</code> 会带来创建引用循环的风险，即两个 <code>Rc&lt;T&gt;</code> 值相互引用，导致内存泄漏。同样，<code>Mutex&lt;T&gt;</code> 也存在创建 <em>死锁</em> 的风险。这些情况发生在某个操作需要锁定两个资源，而两个线程各自获取了一个锁，导致它们无限期地相互等待。如果你对死锁感兴趣，可以尝试创建一个包含死锁的 Rust 程序；然后研究任何语言中互斥锁的死锁缓解策略，并尝试在 Rust 中实现它们。<code>Mutex&lt;T&gt;</code> 和 <code>MutexGuard</code> 的标准库 API 文档提供了有用的信息。",
    "_note": ""
  },
  "Shared-State Concurrency - The Rust Programming Language": {
    "_translate": "共享状态并发 - 《Rust编程语言》",
    "_note": ""
  },
  "You must attempt to acquire the lock before using the data.": {
    "_translate": "您必须在使用数据之前尝试获取锁。",
    "_note": ""
  },
  "When you’re done with the data that the mutex guards, you must unlock the data so other threads can acquire the lock.": {
    "_translate": "当你完成对互斥锁保护的数据的操作后，必须解锁数据，以便其他线程可以获取锁。",
    "_note": ""
  },
  "The API of Mutex<T>": {
    "_translate": "<a class=\"header\" href=\"#the-api-of-mutext\">互斥锁 <code>Mutex&lt;T&gt;</code> 的 API</a>",
    "_note": ""
  },
  "Sharing a Mutex<T> Between Multiple Threads": {
    "_translate": "<a class=\"header\" href=\"#sharing-a-mutext-between-multiple-threads\">在多个线程之间共享 <code>Mutex&lt;T&gt;</code></a>",
    "_note": ""
  },
  "Multiple Ownership with Multiple Threads": {
    "_translate": "<a class=\"header\" href=\"#multiple-ownership-with-multiple-threads\">多线程中的多重所有权</a>",
    "_note": ""
  },
  "Atomic Reference Counting with Arc<T>": {
    "_translate": "<a class=\"header\" href=\"#atomic-reference-counting-with-arct\">使用 <code>Arc&lt;T&gt;</code> 进行原子引用计数</a>",
    "_note": ""
  },
  "Wow, that error message is very wordy! Here’s the important part to focus on: `Rc<Mutex<i32>>` cannot be sent between threads safely. The compiler is also telling us the reason why: the trait `Send` is not implemented for `Rc<Mutex<i32>>`. We’ll talk about Send in the next section: it’s one of the traits that ensures the types we use with threads are meant for use in concurrent situations.": {
    "_translate": "哇，这个错误信息非常冗长！这里需要关注的重要部分是：<code>`Rc&lt;Mutex&lt;i32&gt;&gt;` 不能在线程间安全地传递</code>。编译器还告诉我们原因：<code>`Rc&lt;Mutex&lt;i32&gt;&gt;` 没有实现 `Send` 特性</code>。我们将在下一节讨论 <code>Send</code>：它是确保我们在线程中使用的类型适用于并发情况的特性之一。",
    "_note": ""
  },
  "Unfortunately, Rc<T> is not safe to share across threads. When Rc<T> manages the reference count, it adds to the count for each call to clone and subtracts from the count when each clone is dropped. But it doesn’t use any concurrency primitives to make sure that changes to the count can’t be interrupted by another thread. This could lead to wrong counts—subtle bugs that could in turn lead to memory leaks or a value being dropped before we’re done with it. What we need is a type that is exactly like Rc<T> but one that makes changes to the reference count in a thread-safe way.": {
    "_translate": "不幸的是，<code>Rc&lt;T&gt;</code> 不能安全地在多个线程之间共享。当 <code>Rc&lt;T&gt;</code>\n管理引用计数时，它会在每次调用 <code>clone</code> 时增加计数，并在每个克隆被释放时减少计数。但它没有使用任何并发原语来确保计数的更改不会被另一个线程中断。这可能导致计数错误——细微的错误可能会导致内存泄漏或在我们尚未完成使用某个值时将其释放。我们需要一个类型，它与 <code>Rc&lt;T&gt;</code> 完全相同，但能够以线程安全的方式更改引用计数。",
    "_note": ""
  },
  "Fortunately, Arc<T> is a type like Rc<T> that is safe to use in concurrent situations. The a stands for atomic, meaning it’s an atomically reference-counted type. Atomics are an additional kind of concurrency primitive that we won’t cover in detail here: see the standard library documentation for std::sync::atomic for more details. At this point, you just need to know that atomics work like primitive types but are safe to share across threads.": {
    "_translate": "Fortunately, <code>Arc&lt;T&gt;</code> <em>是</em> 一个像 <code>Rc&lt;T&gt;</code> 一样的类型，可以在并发情况下安全使用。<em>a</em> 代表 <em>原子</em>，意味着它是一个 <em>原子引用计数</em> 类型。原子是另一种并发原语，我们在这里不会详细讨论：有关更多详细信息，请参阅标准库文档 <a href=\"../std/sync/atomic/index.html\"><code>std::sync::atomic</code></a><!-- ignore -->。目前，你只需要知道原子像基本类型一样工作，但可以在线程间安全共享。",
    "_note": ""
  },
  "You might have noticed that counter is immutable, but we could get a mutable reference to the value inside it; this means Mutex<T> provides interior mutability, as the Cell family does. In the same way we used RefCell<T> in Chapter 15 to allow us to mutate contents inside an Rc<T>, we use Mutex<T> to mutate contents inside an Arc<T>.": {
    "_translate": "你可能已经注意到 <code>counter</code> 是不可变的，但我们能够获取其内部值的可变引用；这意味着 <code>Mutex&lt;T&gt;</code> 提供了内部可变性，就像 <code>Cell</code> 系列一样。同样地，我们在第 15 章中使用 <code>RefCell&lt;T&gt;</code> 允许我们在 <code>Rc&lt;T&gt;</code> 内部修改内容，我们使用 <code>Mutex&lt;T&gt;</code> 来在 <code>Arc&lt;T&gt;</code> 内部修改内容。",
    "_note": ""
  },
  "Another detail to note is that Rust can’t protect you from all kinds of logic errors when you use Mutex<T>. Recall from Chapter 15 that using Rc<T> came with the risk of creating reference cycles, where two Rc<T> values refer to each other, causing memory leaks. Similarly, Mutex<T> comes with the risk of creating deadlocks. These occur when an operation needs to lock two resources and two threads have each acquired one of the locks, causing them to wait for each other forever. If you’re interested in deadlocks, try creating a Rust program that has a deadlock; then research deadlock mitigation strategies for mutexes in any language and have a go at implementing them in Rust. The standard library API documentation for Mutex<T> and MutexGuard offers useful information.": {
    "_translate": "另一个需要注意的细节是，Rust 不能保护你免受所有类型的逻辑错误，当你使用 <code>Mutex&lt;T&gt;</code> 时。回想第 15 章，使用 <code>Rc&lt;T&gt;</code> 会带来创建引用循环的风险，即两个 <code>Rc&lt;T&gt;</code> 值相互引用，导致内存泄漏。同样，<code>Mutex&lt;T&gt;</code> 也存在创建 <em>死锁</em> 的风险。这些情况发生在某个操作需要锁定两个资源，而两个线程各自获取了一个锁，导致它们无限期地相互等待。如果你对死锁感兴趣，可以尝试创建一个包含死锁的 Rust 程序；然后研究任何语言中互斥锁的死锁缓解策略，并尝试在 Rust 中实现它们。<code>Mutex&lt;T&gt;</code> 和 <code>MutexGuard</code> 的标准库 API 文档提供了有用的信息。",
    "_note": ""
  },
  "Message passing is a fine way to handle concurrency, but it’s not the only way. Another method would be for multiple threads to access the same shared data. Consider this part of the slogan from the Go language documentation again: “Do not communicate by sharing memory.”": {
    "_translate": "【翻译引擎出错，请联系作者】",
    "_note": ""
  },
  "In a way, channels in any programming language are similar to single ownership, because once you transfer a value down a channel, you should no longer use that value. Shared-memory concurrency is like multiple ownership: multiple threads can access the same memory location at the same time. As you saw in Chapter 15, where smart pointers made multiple ownership possible, multiple ownership can add complexity because these different owners need managing. Rust’s type system and ownership rules greatly assist in getting this management correct. For an example, let’s look at mutexes, one of the more common concurrency primitives for shared memory.": {
    "_translate": "【翻译引擎出错，请联系作者】",
    "_note": ""
  },
  "Mutex is an abbreviation for mutual exclusion, as in a mutex allows only one thread to access some data at any given time. To access the data in a mutex, a thread must first signal that it wants access by asking to acquire the mutex’s lock. The lock is a data structure that is part of the mutex that keeps track of who currently has exclusive access to the data. Therefore, the mutex is described as guarding the data it holds via the locking system.": {
    "_translate": "【翻译引擎出错，请联系作者】",
    "_note": ""
  },
  "As an example of how to use a mutex, let’s start by using a mutex in a single-threaded context, as shown in Listing 16-12.": {
    "_translate": "【翻译引擎出错，请联系作者】",
    "_note": ""
  },
  "Now let’s try to share a value between multiple threads using Mutex<T>. We’ll spin up 10 threads and have them each increment a counter value by 1, so the counter goes from 0 to 10. The example in Listing 16-13 will have a compiler error, and we’ll use that error to learn more about using Mutex<T> and how Rust helps us use it correctly.": {
    "_translate": "【翻译引擎出错，请联系作者】",
    "_note": ""
  },
  "The error message states that the counter value was moved in the previous iteration of the loop. Rust is telling us that we can’t move the ownership of lock counter into multiple threads. Let’s fix the compiler error with the multiple-ownership method we discussed in Chapter 15.": {
    "_translate": "【翻译引擎出错，请联系作者】",
    "_note": ""
  },
  "In Chapter 15, we gave a value to multiple owners by using the smart pointer Rc<T> to create a reference counted value. Let’s do the same here and see what happens. We’ll wrap the Mutex<T> in Rc<T> in Listing 16-14 and clone the Rc<T> before moving ownership to the thread.": {
    "_translate": "【翻译引擎出错，请联系作者】",
    "_note": ""
  },
  "Let’s return to our example: Arc<T> and Rc<T> have the same API, so we fix our program by changing the use line, the call to new, and the call to clone. The code in Listing 16-15 will finally compile and run.": {
    "_translate": "【翻译引擎出错，请联系作者】",
    "_note": ""
  }
}