{
  "Streams": {
    "_translate": "<a class=\"header\" href=\"#streams\">流</a>",
    "_note": ""
  },
  "So far in this chapter, we have mostly stuck to individual futures. The one big exception was the async channel we used. Recall how we used the receiver for our async channel in the “Message Passing” earlier in the chapter. The async recv method produces a sequence of items over time. This is an instance of a much more general pattern, often called a stream.": {
    "_translate": "到目前为止，在本章中，我们主要关注的是单个的 future。唯一的重大例外是我们使用的异步通道。回想一下我们如何在本章的<a href=\"ch17-02-concurrency-with-async.html#message-passing\">“消息传递”</a>部分中使用异步通道的接收器。异步<code>recv</code>方法随时间生成一系列项目。这是一个更普遍模式的实例，通常称为<em>流</em>。",
    "_note": ""
  },
  "A sequence of items is something we’ve seen before, when we looked at the Iterator trait in Chapter 13, but there are two differences between iterators and the async channel receiver. The first difference is the element of time: iterators are synchronous, while the channel receiver is asynchronous. The second difference is the API. When working directly with an Iterator, we call its synchronous next method. With the trpl::Receiver stream in particular, we called an asynchronous recv method instead, but these APIs otherwise feel very similar.": {
    "_translate": "一系列项目是我们之前在第 13 章讨论 <code>Iterator</code> 特性时见过的，但迭代器和异步通道接收器之间有两个不同点。第一个不同点是时间因素：迭代器是同步的，而通道接收器是异步的。第二个不同点是 API。当我们直接使用 <code>Iterator</code> 时，我们调用其同步的 <code>next</code> 方法。而对于 <code>trpl::Receiver</code> 流，我们调用的是异步的 <code>recv</code> 方法，但这些 API 否则感觉非常相似。",
    "_note": ""
  },
  "We start with an array of numbers, which we convert to an iterator and then call map on to double all the values. Then we convert the iterator into a stream using the trpl::stream_from_iter function. Then we loop over the items in the stream as they arrive with the while let loop.": {
    "_translate": "我们从一个数字数组开始，将其转换为迭代器，然后调用<code>map</code>来将所有值翻倍。然后我们使用<code>trpl::stream_from_iter</code>函数将迭代器转换为流。然后我们使用<code>while let</code>循环遍历流中的项目。",
    "_note": ""
  },
  "That similarity isn’t a coincidence. A stream is similar to an asynchronous form of iteration. Whereas the trpl::Receiver specifically waits to receive messages, though, the general-purpose stream API is much more general: it provides the next item the way Iterator does, but asynchronously. The similarity between iterators and streams in Rust means we can actually create a stream from any iterator. As with an iterator, we can work with a stream by calling its next method and then awaiting the output, as in Listing 17-30.": {
    "_translate": "这种相似性并非偶然。流类似于异步形式的迭代。虽然 <code>trpl::Receiver</code> 特定地等待接收消息，但通用的流 API 要广泛得多：它以 <code>Iterator</code> 的方式提供下一个项目，但异步进行。Rust 中迭代器和流之间的相似性意味着我们实际上可以从任何迭代器创建一个流。与迭代器一样，我们可以通过调用流的 <code>next</code> 方法并等待输出来处理流，如示例 17-30 所示。",
    "_note": ""
  },
  "Unfortunately, when we try to run the code, it doesn’t compile. Instead, as we can see in the output, it reports that there is no next method available.": {
    "_translate": "不幸的是，当我们尝试运行代码时，它无法编译。相反，正如我们在输出中看到的，它报告说没有可用的<code>next</code>方法。",
    "_note": ""
  },
  "As the output suggests, the reason for the compiler error is that we need the right trait in scope to be able to use the next method. Given our discussion so far, you might reasonably expect that to be Stream, but the trait we need here is actually StreamExt. The Ext there is for “extension”: this is a common pattern in the Rust community for extending one trait with another.": {
    "_translate": "正如输出所建议的，编译器错误的原因是我们需要正确的特质在作用域内才能使用 <code>next</code> 方法。根据我们到目前为止的讨论，你可能会合理地认为这应该是 <code>Stream</code>，但这里我们需要的特质实际上是 <code>StreamExt</code>。这里的 <code>Ext</code> 表示“扩展”：这是 Rust 社区中扩展一个特质的常见模式。",
    "_note": ""
  },
  "The fix to the compiler error is to add a use statement for trpl::StreamExt, as in Listing 17-31.": {
    "_translate": "修复编译器错误的方法是添加一个 <code>use</code> 语句，用于 <code>trpl::StreamExt</code>，如列表 17-31 所示。",
    "_note": ""
  },
  "Why do we need StreamExt instead of Stream, and what does the Stream trait itself do? Briefly, the answer is that throughout the Rust ecosystem, the Stream trait defines a low-level interface which effectively combines the Iterator and Future traits. The StreamExt trait supplies a higher-level set of APIs on top of Stream, including the next method as well as other utility methods similar to those provided by the Iterator trait. We’ll return to the Stream and StreamExt traits in a bit more detail at the end of the chapter. For now, this is enough to let us keep moving.": {
    "_translate": "为什么我们需要<code>StreamExt</code>而不是<code>Stream</code>，<code>Stream</code>特质本身做了什么？简而言之，答案是在整个Rust生态系统中，<code>Stream</code>特质定义了一个低级别的接口，有效地结合了<code>Iterator</code>和<code>Future</code>特质。<code>StreamExt</code>特质在<code>Stream</code>之上提供了一组更高层次的API，包括<code>next</code>方法以及其他类似于<code>Iterator</code>特质提供的实用方法。我们将在本章末尾更详细地回到<code>Stream</code>和<code>StreamExt</code>特质。现在，这些足以让我们继续前进。",
    "_note": ""
  },
  "Of course, this isn’t very interesting. We could do that with normal iterators and without any async at all. So let’s look at some of the other things we can do which are unique to streams.": {
    "_translate": "当然，这并不是非常有趣。我们可以通过普通的迭代器来实现，完全不需要任何异步。所以让我们看看我们可以做的一些其他事情，这些是流独有的。",
    "_note": ""
  },
  "Composing Streams": {
    "_translate": "<a class=\"header\" href=\"#composing-streams\">组合流</a>",
    "_note": ""
  },
  "Many concepts are naturally represented as streams: items becoming available in a queue, or working with more data than can fit in a computer’s memory by only pulling chunks of it from the file system at a time, or data arriving over the network over time. Because streams are futures, we can use them with any other kind of future, too, and we can combine them in interesting ways. For example, we can batch up events to avoid triggering too many network calls, set timeouts on sequences of long-running operations, or throttle user interface events to avoid doing needless work.": {
    "_translate": "许多概念自然地表示为流：项目在队列中变得可用，或者通过一次从文件系统中提取一部分数据来处理超出计算机内存的数据，或者数据随时间通过网络到达。因为流是未来的，我们可以将它们与任何其他类型的未来一起使用，也可以以有趣的方式将它们组合起来。例如，我们可以批量处理事件以避免触发过多的网络调用，为长时间运行的操作序列设置超时，或限制用户界面事件以避免不必要的工作。",
    "_note": ""
  },
  "With all those pieces put together, this code works the way we want! What’s more, now that we have StreamExt in scope, we can use all of its utility methods, just as with iterators. For example, in Listing 17-32, we use the filter method to filter out everything but multiples of three and five.": {
    "_translate": "将所有这些部分组合在一起，这段代码就能按我们想要的方式工作！更重要的是，现在我们已经将 <code>StreamExt</code> 引入作用域，我们可以使用它的所有实用方法，就像使用迭代器一样。例如，在示例 17-32 中，我们使用 <code>filter</code> 方法来过滤掉除三和五的倍数之外的所有内容。",
    "_note": ""
  },
  "Let’s start by building a little stream of messages, as a stand-in for a stream of data we might see from a WebSocket or another real-time communication protocol. In Listing 17-33, we create a function get_messages which returns impl Stream<Item = String>. For its implementation, we create an async channel, loop over the first ten letters of the English alphabet, and send them across the channel.": {
    "_translate": "让我们先构建一个消息流，作为我们可能从WebSocket或其他实时通信协议中看到的数据流的替代品。在清单17-33中，我们创建了一个函数<code>get_messages</code>，它返回<code>impl Stream&lt;Item = String&gt;</code>。在其实现中，我们创建了一个异步通道，遍历英文字母表的前十个字母，并将它们通过通道发送。",
    "_note": ""
  },
  "We also use a new type: ReceiverStream, which converts the rx receiver from the trpl::channel into a Stream with a next method. Back in main, we use a while let loop to print all the messages from the stream.": {
    "_translate": "我们还使用了一种新的类型：<code>ReceiverStream</code>，它将来自<code>trpl::channel</code>的<code>rx</code>接收器转换为具有<code>next</code>方法的<code>Stream</code>。在<code>main</code>中，我们使用<code>while let</code>循环来打印流中的所有消息。",
    "_note": ""
  },
  "When we run this code, we get exactly the results we would expect:": {
    "_translate": "当我们运行这段代码时，我们得到的正是我们预期的结果：",
    "_note": ""
  },
  "We could do this with the regular Receiver API, or even the regular Iterator API, though. Let’s add something that requires streams: adding a timeout which applies to every item in the stream, and a delay on the items we emit.": {
    "_translate": "我们可以通过常规的<code>Receiver</code> API，或者甚至是常规的<code>Iterator</code> API来实现这一点。不过，让我们添加一些需要流的东西：为流中的每个项目添加一个超时，并在我们发出的项目上添加延迟。",
    "_note": ""
  },
  "In Listing 17-34, we start by adding a timeout to the stream with the timeout method, which comes from the StreamExt trait. Then we update the body of the while let loop, because the stream now returns a Result. The Ok variant indicates a message arrived in time; the Err variant indicates that the timeout elapsed before any message arrived. We match on that result and either print the message when we receive it successfully, or print a notice about the timeout. Finally, notice that we pin the messages after applying the timeout to them, because the timeout helper produces a stream which needs to be pinned to be polled.": {
    "_translate": "在清单 17-34 中，我们首先使用来自 <code>StreamExt</code> 特性的 <code>timeout</code> 方法为流添加超时。然后我们更新 <code>while let</code> 循环的主体，因为流现在返回一个 <code>Result</code>。<code>Ok</code> 变体表示消息及时到达；<code>Err</code> 变体表示在任何消息到达之前超时已过期。我们对这个结果进行 <code>match</code>，当成功接收到消息时打印消息，或者打印超时通知。最后，注意我们在应用超时后固定消息，因为超时助手生成的流需要被固定才能被轮询。",
    "_note": ""
  },
  "However, because there are no delays between messages, this timeout does not change the behavior of the program. Let’s add a variable delay to the messages we send. In get_messages, we use the enumerate iterator method with the messages array so that we can get the index of each item we are sending along with the item itself. Then we apply a 100 millisecond delay to even-index items and a 300 millisecond delay to odd-index items, to simulate the different delays we might see from a stream of messages in the real world. Because our timeout is for 200 milliseconds, this should affect half of the messages.": {
    "_translate": "然而，因为消息之间没有延迟，这个超时并不会改变程序的行为。让我们给发送的消息添加一个可变的延迟。在<code>get_messages</code>中，我们使用<code>enumerate</code>迭代器方法与<code>messages</code>数组，这样我们可以获取我们发送的每个项目的索引以及项目本身。然后我们对偶数索引的项目应用100毫秒的延迟，对奇数索引的项目应用300毫秒的延迟，以模拟在现实世界中我们可能从消息流中看到的不同延迟。因为我们的超时时间是200毫秒，这应该会影响一半的消息。",
    "_note": ""
  },
  "Instead, we leave get_messages as a regular function which returns a stream, and spawn a task to handle the async sleep calls.": {
    "_translate": "相反，我们将<code>get_messages</code>保留为一个返回流的普通函数，并启动一个任务来处理异步<code>sleep</code>调用。",
    "_note": ""
  },
  "To sleep between messages in the get_messages function without blocking, we need to use async. However, we can’t make get_messages itself into an async function, because then we’d return a Future<Output = Stream<Item = String>> instead of a Stream<Item = String>>. The caller would have to await get_messages itself to get access to the stream. But remember: everything in a given future happens linearly; concurrency happens between futures. Awaiting get_messages would require it to send all the messages, including sleeping between sending each message, before returning the receiver stream. As a result, the timeout would end up useless. There would be no delays in the stream itself: the delays would all happen before the stream was even available.": {
    "_translate": "为了在 <code>get_messages</code> 函数中不阻塞地在消息之间休眠，我们需要使用 async。但是，我们不能将 <code>get_messages</code> 本身变成一个 async 函数，因为那样我们会返回一个 <code>Future&lt;Output = Stream&lt;Item = String&gt;&gt;</code> 而不是一个 <code>Stream&lt;Item = String&gt;&gt;</code>。调用者必须等待 <code>get_messages</code> 本身才能访问流。但请记住：给定未来中的所有事情都是线性发生的；并发发生在未来之间。等待 <code>get_messages</code> 会要求它在返回接收者流之前发送所有消息，包括在发送每条消息之间休眠。因此，超时将变得无用。流本身不会有延迟：所有延迟都会在流可用之前发生。",
    "_note": ""
  },
  "Note: calling spawn_task in this way works because we already set up our runtime. Calling this particular implementation of spawn_task without first setting up a runtime will cause a panic. Other implementations choose different tradeoffs: they might spawn a new runtime and so avoid the panic but end up with a bit of extra overhead, or simply not provide a standalone way to spawn tasks without reference to a runtime. You should make sure you know what tradeoff your runtime has chosen and write your code accordingly!": {
    "_translate": "注意：以这种方式调用<code>spawn_task</code>可以工作，因为我们已经设置了我们的运行时。在没有首先设置运行时的情况下调用此特定实现的<code>spawn_task</code>会导致恐慌。其他实现选择了不同的权衡：它们可能会启动一个新的运行时，从而避免恐慌，但最终会增加一些额外的开销，或者根本不会提供一种独立于运行时来启动任务的方法。您应该确保了解您的运行时选择了哪种权衡，并相应地编写代码！",
    "_note": ""
  },
  "Now our code has a much more interesting result! Between every other pair of messages, we see an error reported: Problem: Elapsed(()).": {
    "_translate": "现在我们的代码有了一个更有趣的结果！在每一对消息之间，我们看到一个错误报告：<code>Problem: Elapsed(())</code>。",
    "_note": ""
  },
  "The timeout doesn’t prevent the messages from arriving in the end—we still get all of the original messages. This is because our channel is unbounded: it can hold as many messages as we can fit in memory. If the message doesn’t arrive before the timeout, our stream handler will account for that, but when it polls the stream again, the message may now have arrived.": {
    "_translate": "超时并不会阻止消息最终到达——我们仍然会收到所有原始消息。这是因为我们的通道是无界的：它可以容纳我们内存中能容纳的尽可能多的消息。如果消息在超时前没有到达，我们的流处理器会对此进行处理，但当它再次轮询流时，消息可能已经到达。",
    "_note": ""
  },
  "You can get different behavior if needed by using other kinds of channels, or other kinds of streams more generally. Let’s see one of those in practice in our final example for this section, by combining a stream of time intervals with this stream of messages.": {
    "_translate": "你可以通过使用其他类型的通道，或更广泛地说，使用其他类型的流来获得所需的不同行为。让我们在本节的最后一个例子中通过结合时间间隔流和消息流来实际看看其中一个。",
    "_note": ""
  },
  "Merging Streams": {
    "_translate": "<a class=\"header\" href=\"#merging-streams\">合并流</a>",
    "_note": ""
  },
  "First, let’s create another stream, which will emit an item every millisecond if we let it run directly. For simplicity, we can use the sleep function to send a message on a delay, and combine it with the same approach of creating a stream from a channel we used in get_messages. The difference is that this time, we’re going to send back the count of intervals which has elapsed, so the return type will be impl Stream<Item = u32>, and we can call the function get_intervals.": {
    "_translate": "首先，让我们创建另一个流，如果让它直接运行，它将每毫秒发出一个项目。为了简单起见，我们可以使用<code>sleep</code>函数来延迟发送消息，并结合我们在<code>get_messages</code>中使用的方法，从通道创建流。不同的是，这次我们将返回已过去的时间间隔的计数，因此返回类型将是<code>impl Stream&lt;Item = u32&gt;</code>，我们可以将此函数称为<code>get_intervals</code>。",
    "_note": ""
  },
  "In Listing 17-36, we start by defining a count in the task. (We could define it outside the task, too, but it is clearer to limit the scope of any given variable.) Then we create an infinite loop. Each iteration of the loop asynchronously sleeps for one millisecond, increments the count, and then sends it over the channel. Because this is all wrapped in the task created by spawn_task, all of it will get cleaned up along with the runtime, including the infinite loop.": {
    "_translate": "在清单 17-36 中，我们首先在任务中定义一个 <code>count</code>。（我们也可以在任务外部定义它，但限制任何给定变量的作用域会更清晰。）然后我们创建一个无限循环。循环的每次迭代都会异步休眠一毫秒，增加计数，然后通过通道发送。因为所有这些都封装在由 <code>spawn_task</code> 创建的任务中，所以所有这些都会与运行时一起被清理，包括无限循环。",
    "_note": ""
  },
  "This kind of infinite loop, which only ends when the whole runtime gets torn down, is fairly common in async Rust: many programs need to keep running indefinitely. With async, this doesn’t block anything else, as long as there is at least one await point in each iteration through the loop.": {
    "_translate": "这种无限循环，只有在运行时被完全拆除时才会结束，在异步 Rust 中相当常见：许多程序需要无限期地运行。使用异步，只要循环的每次迭代中至少有一个 await 点，就不会阻塞其他任何内容。",
    "_note": ""
  },
  "Back in our main function’s async block, we start by calling get_intervals. Then we merge the messages and intervals streams with the merge method, which combines multiple streams into one stream that produces items from any of the source streams as soon as the items are available, without imposing any particular ordering. Finally, we loop over that combined stream instead of over messages (Listing 17-37).": {
    "_translate": "在我们的主函数的异步块中，我们首先调用<code>get_intervals</code>。然后我们使用<code>merge</code>方法将<code>messages</code>和<code>intervals</code>流合并，该方法将多个流合并为一个流，该流会立即从任何源流中生成项目，而不会强加任何特定的顺序。最后，我们遍历这个合并的流而不是<code>messages</code>（清单17-37）。",
    "_note": ""
  },
  "At this point, neither messages nor intervals needs to be pinned or mutable, because both will be combined into the single merged stream. However, this call to merge does not compile! (Neither does the next call in the while let loop, but we’ll come back to that after fixing this.) The two streams have different types. The messages stream has the type Timeout<impl Stream<Item = String>>, where Timeout is the type which implements Stream for a timeout call. Meanwhile, the intervals stream has the type impl Stream<Item = u32>. To merge these two streams, we need to transform one of them to match the other.": {
    "_translate": "在这一点上，<code>messages</code> 和 <code>intervals</code> 都不需要被固定或可变，因为它们将被合并成单一的 <code>merged</code> 流。然而，这个 <code>merge</code> 调用无法编译！（<code>while let</code> 循环中的 <code>next</code> 调用也无法编译，但我们在解决这个问题后会回到这一点。）这两个流有不同的类型。<code>messages</code> 流的类型为 <code>Timeout&lt;impl Stream&lt;Item = String&gt;&gt;</code>，其中 <code>Timeout</code> 是为 <code>timeout</code> 调用实现 <code>Stream</code> 的类型。同时，<code>intervals</code> 流的类型为 <code>impl Stream&lt;Item = u32&gt;</code>。为了合并这两个流，我们需要将其中一个转换为与另一个匹配。",
    "_note": ""
  },
  "In Listing 17-38, we rework the intervals stream, because messages is already in the basic format we want and has to handle timeout errors. First, we can use the map helper method to transform the intervals into a string. Second, we need to match the Timeout from messages. Because we don’t actually want a timeout for intervals, though, we can just create a timeout which is longer than the other durations we are using. Here, we create a 10-second timeout with Duration::from_secs(10). Finally, we need to make stream mutable, so that the while let loop’s next calls can iterate through the stream, and pin it so that it’s safe to do so.": {
    "_translate": "在清单 17-38 中，我们重新处理 <code>intervals</code> 流，因为 <code>messages</code> 已经是我们想要的基本格式，并且需要处理超时错误。首先，我们可以使用 <code>map</code> 辅助方法将 <code>intervals</code> 转换为字符串。其次，我们需要匹配来自 <code>messages</code> 的 <code>Timeout</code>。然而，我们实际上并不希望 <code>intervals</code> 有超时，因此我们可以创建一个比我们使用的其他持续时间更长的超时。这里，我们使用 <code>Duration::from_secs(10)</code> 创建一个 10 秒的超时。最后，我们需要将 <code>stream</code> 设置为可变的，以便 <code>while let</code> 循环的 <code>next</code> 调用可以遍历流，并将其固定，以确保这样做是安全的。",
    "_note": ""
  },
  "That gets us almost to where we need to be. Everything type checks. If you run this, though, there will be two problems. First, it will never stop! You’ll need to stop it with ctrl-c. Second, the messages from the English alphabet will be buried in the midst of all the interval counter messages:": {
    "_translate": "这让我们<em>几乎</em>达到了我们需要的状态。所有类型都检查通过。但是，如果你运行这段代码，将会出现两个问题。首先，它永远不会停止！你需要用<span class=\"keystroke\">ctrl-c</span>来停止它。其次，来自英文字母的消息将被大量的时间间隔计数器消息所淹没：",
    "_note": ""
  },
  "Listing 17-39 shows one way to solve these last two problems. First, we use the throttle method on the intervals stream, so that it doesn’t overwhelm the messages stream. Throttling is a way of limiting the rate at which a function will be called—or, in this case, how often the stream will be polled. Once every hundred milliseconds should do, because that is in the same ballpark as how often our messages arrive.": {
    "_translate": "列表 17-39 展示了解决最后两个问题的一种方法。首先，我们在 <code>intervals</code> 流上使用 <code>throttle</code> 方法，以防止它压垮 <code>messages</code> 流。节流是一种限制函数调用频率的方法——或者在这种情况下，限制流被轮询的频率。每一百毫秒一次应该足够了，因为这与我们的消息到达的频率大致相同。",
    "_note": ""
  },
  "To limit the number of items we will accept from a stream, we can use the take method. We apply it to the merged stream, because we want to limit the final output, not just one stream or the other.": {
    "_translate": "为了限制我们从流中接受的项目数量，我们可以使用<code>take</code>方法。我们将其应用于<em>合并的</em>流，因为我们要限制最终的输出，而不仅仅是其中一个流或另一个流。",
    "_note": ""
  },
  "There’s one last thing we need to handle: errors! With both of these channel-based streams, the send calls could fail when the other side of the channel closes—and that’s just a matter of how the runtime executes the futures which make up the stream. Up until now we have ignored this by calling unwrap, but in a well-behaved app, we should explicitly handle the error, at minimum by ending the loop so we don’t try to send any more messages! Listing 17-40 shows a simple error strategy: print the issue and then break from the loops. As usual, the correct way to handle a message send error will vary—just make sure you have a strategy.": {
    "_translate": "还有最后一件事需要处理：错误！对于这两个基于通道的流，当通道的另一端关闭时，<code>send</code> 调用可能会失败——这仅仅是运行时执行构成流的未来对象的方式的问题。到目前为止，我们通过调用 <code>unwrap</code> 忽略了这一点，但在一个行为良好的应用程序中，我们应该显式地处理错误，至少通过结束循环来避免尝试发送更多消息！列表 17-40 显示了一个简单的错误处理策略：打印问题，然后从循环中 <code>break</code>。和往常一样，处理消息发送错误的正确方法会有所不同——只需确保你有一个策略。",
    "_note": ""
  },
  "Now when we run the program, it stops after pulling twenty items from the stream, and the intervals don’t overwhelm the messages. We also don’t get Interval: 100 or Interval: 200 or so on, but instead get Interval: 1, Interval: 2, and so on—even though we have a source stream which can produce an event every millisecond. That’s because the throttle call produces a new stream, wrapping the original stream, so that the original stream only gets polled at the throttle rate, not its own “native” rate. We don’t have a bunch of unhandled interval messages we’re choosing to ignore. Instead, we never produce those interval messages in the first place! This is the inherent “laziness” of Rust’s futures at work again, allowing us to choose our performance characteristics.": {
    "_translate": "现在当我们运行程序时，它在从流中拉取二十个项目后停止，而且间隔不会压倒消息。我们也不会得到<code>Interval: 100</code>或<code>Interval: 200</code>等，而是得到<code>Interval: 1</code>、<code>Interval: 2</code>等——尽管我们有一个<em>可以</em>每毫秒生成一个事件的源流。这是因为<code>throttle</code>调用生成了一个新的流，包裹了原始流，使得原始流只在节流速率下被轮询，而不是其自身的“原生”速率。我们没有一堆未处理的间隔消息需要选择忽略。相反，我们从一开始就从未生成这些间隔消息！这是Rust的未来机制固有的“惰性”再次发挥作用，允许我们选择性能特性。",
    "_note": ""
  },
  "Now that we’ve seen a bunch of async in practice, let’s take a step back and dig into a few of the details of how Future, Stream, and the other key traits which Rust uses to make async work.": {
    "_translate": "现在我们已经看到了很多异步的实际应用，让我们退一步，深入探讨一下 Rust 用于实现异步的关键特质 <code>Future</code>、<code>Stream</code> 以及其他一些细节。",
    "_note": ""
  },
  "Streams - The Rust Programming Language": {
    "_translate": "Streams - 《Rust 编程语言》",
    "_note": ""
  },
  "A sequence of items is something we’ve seen before, when we looked at the Iterator trait in Chapter 13. There are two differences between iterators and the async channel receiver, though. The first is the element of time: iterators are synchronous, while the channel receiver is asynchronous. The second is the API. When working directly with an Iterator, we call its synchronous next method. With the trpl::Receiver stream in particular, we called an asynchronous recv method instead. These APIs otherwise feel very similar.": {
    "_translate": "一系列项目是我们之前在第 13 章讨论 <code>Iterator</code> 特性时见过的。然而，迭代器和异步通道接收器之间有两个不同点。第一个是时间因素：迭代器是同步的，而通道接收器是异步的。第二个是 API。当我们直接使用 <code>Iterator</code> 时，我们调用其同步的 <code>next</code> 方法。而对于 <code>trpl::Receiver</code> 流，我们调用的是异步的 <code>recv</code> 方法。这些 API 否则感觉非常相似。",
    "_note": ""
  }
}