{
  "Using Trait Objects That Allow for Values of Different Types": {
    "_translate": "<a class=\"header\" href=\"#using-trait-objects-that-allow-for-values-of-different-types\">使用允许不同类型值的特征对象</a>",
    "_note": ""
  },
  "In Chapter 8, we mentioned that one limitation of vectors is that they can store elements of only one type. We created a workaround in Listing 8-9 where we defined a SpreadsheetCell enum that had variants to hold integers, floats, and text. This meant we could store different types of data in each cell and still have a vector that represented a row of cells. This is a perfectly good solution when our interchangeable items are a fixed set of types that we know when our code is compiled.": {
    "_translate": "在第 8 章中，我们提到向量的一个限制是它们只能存储一种类型的元素。我们在列表 8-9 中创建了一个变通方法，定义了一个 <code>SpreadsheetCell</code> 枚举，该枚举具有存储整数、浮点数和文本的变体。这意味着我们可以在每个单元格中存储不同类型的數據，同时仍然有一个表示单元格行的向量。当我们的可互换项是在代码编译时已知的固定类型集时，这是一个非常好的解决方案。",
    "_note": ""
  },
  "However, sometimes we want our library user to be able to extend the set of types that are valid in a particular situation. To show how we might achieve this, we’ll create an example graphical user interface (GUI) tool that iterates through a list of items, calling a draw method on each one to draw it to the screen—a common technique for GUI tools. We’ll create a library crate called gui that contains the structure of a GUI library. This crate might include some types for people to use, such as Button or TextField. In addition, gui users will want to create their own types that can be drawn: for instance, one programmer might add an Image and another might add a SelectBox.": {
    "_translate": "然而，有时我们希望我们的库用户能够扩展在特定情况下有效的类型集。为了展示我们如何实现这一点，我们将创建一个示例图形用户界面（GUI）工具，该工具遍历项目列表，调用每个项目的<code>draw</code>方法将其绘制到屏幕上——这是GUI工具的常见技术。我们将创建一个名为<code>gui</code>的库crate，其中包含GUI库的结构。此crate可能包括一些供人们使用的类型，例如<code>Button</code>或<code>TextField</code>。此外，<code>gui</code>用户将希望创建可以绘制的自定义类型：例如，一个程序员可能会添加一个<code>Image</code>，而另一个可能会添加一个<code>SelectBox</code>。",
    "_note": ""
  },
  "We won’t implement a fully fledged GUI library for this example but will show how the pieces would fit together. At the time of writing the library, we can’t know and define all the types other programmers might want to create. But we do know that gui needs to keep track of many values of different types, and it needs to call a draw method on each of these differently typed values. It doesn’t need to know exactly what will happen when we call the draw method, just that the value will have that method available for us to call.": {
    "_translate": "我们不会为这个例子实现一个完整的GUI库，但会展示这些部分是如何组合在一起的。在编写库时，我们无法知道和定义其他程序员可能想要创建的所有类型。但我们知道 <code>gui</code> 需要跟踪许多不同类型的值，并且需要在这些不同类型的值上调用 <code>draw</code> 方法。它不需要确切地知道当我们调用 <code>draw</code> 方法时会发生什么，只需要知道这些值会有该方法供我们调用。",
    "_note": ""
  },
  "Defining a Trait for Common Behavior": {
    "_translate": "<a class=\"header\" href=\"#defining-a-trait-for-common-behavior\">定义一个用于常见行为的特征</a>",
    "_note": ""
  },
  "To do this in a language with inheritance, we might define a class named Component that has a method named draw on it. The other classes, such as Button, Image, and SelectBox, would inherit from Component and thus inherit the draw method. They could each override the draw method to define their custom behavior, but the framework could treat all of the types as if they were Component instances and call draw on them. But because Rust doesn’t have inheritance, we need another way to structure the gui library to allow users to extend it with new types.": {
    "_translate": "为了在支持继承的语言中实现这一点，我们可能会定义一个名为 <code>Component</code> 的类，该类有一个名为 <code>draw</code> 的方法。其他类，如 <code>Button</code>、<code>Image</code> 和 <code>SelectBox</code>，将从 <code>Component</code> 继承，因此也会继承 <code>draw</code> 方法。它们各自可以重写 <code>draw</code> 方法以定义其自定义行为，但框架可以将所有类型视为 <code>Component</code> 实例并调用 <code>draw</code> 方法。但由于 Rust 没有继承，我们需要另一种方式来构建 <code>gui</code> 库，以允许用户使用新类型扩展它。",
    "_note": ""
  },
  "We’ve mentioned that, in Rust, we refrain from calling structs and enums “objects” to distinguish them from other languages’ objects. In a struct or enum, the data in the struct fields and the behavior in impl blocks are separated, whereas in other languages, the data and behavior combined into one concept is often labeled an object. However, trait objects are more like objects in other languages in the sense that they combine data and behavior. But trait objects differ from traditional objects in that we can’t add data to a trait object. Trait objects aren’t as generally useful as objects in other languages: their specific purpose is to allow abstraction across common behavior.": {
    "_translate": "我们提到，在 Rust 中，我们避免将结构体和枚举称为“对象”，以区别于其他语言的“对象”。在结构体或枚举中，结构体字段中的数据和 <code>impl</code> 块中的行为是分开的，而在其他语言中，数据和行为结合成一个概念通常被称为对象。然而，特质对象 <em>确实</em> 更像其他语言中的对象，因为它们结合了数据和行为。但特质对象与传统对象不同，我们不能向特质对象添加数据。特质对象不如其他语言中的对象那么通用：它们的特定目的是允许跨常见行为的抽象。",
    "_note": ""
  },
  "Listing 18-3 shows how to define a trait named Draw with one method named draw:": {
    "_translate": "列表 18-3 显示了如何定义一个名为 <code>Draw</code> 的 trait，其中包含一个名为 <code>draw</code> 的方法：",
    "_note": ""
  },
  "To implement the behavior we want gui to have, we’ll define a trait named Draw that will have one method named draw. Then we can define a vector that takes a trait object. A trait object points to both an instance of a type implementing our specified trait and a table used to look up trait methods on that type at runtime. We create a trait object by specifying some sort of pointer, such as a & reference or a Box<T> smart pointer, then the dyn keyword, and then specifying the relevant trait. (We’ll talk about the reason trait objects must use a pointer in Chapter 20 in the section “Dynamically Sized Types and the Sized Trait.”) We can use trait objects in place of a generic or concrete type. Wherever we use a trait object, Rust’s type system will ensure at compile time that any value used in that context will implement the trait object’s trait. Consequently, we don’t need to know all the possible types at compile time.": {
    "_translate": "为了实现我们希望 <code>gui</code> 具有的行为，我们将定义一个名为 <code>Draw</code> 的特征，该特征将有一个名为 <code>draw</code> 的方法。然后我们可以定义一个接受 <em>特征对象</em> 的向量。特征对象指向实现我们指定特征的类型的实例和一个用于在运行时查找该类型特征方法的表。我们通过指定某种指针（如 <code>&amp;</code> 引用或 <code>Box&lt;T&gt;</code> 智能指针），然后是 <code>dyn</code> 关键字，再指定相关的特征来创建特征对象。（我们将在第 20 章的 <a href=\"ch20-04-advanced-types.html#dynamically-sized-types-and-the-sized-trait\">“动态大小类型和 <code>Sized</code> 特征”</a><!-- ignore --> 部分讨论特征对象必须使用指针的原因。）我们可以在泛型或具体类型的地方使用特征对象。无论何时使用特征对象，Rust 的类型系统都会在编译时确保在该上下文中使用的任何值都实现了特征对象的特征。因此，我们不需要在编译时知道所有可能的类型。",
    "_note": ""
  },
  "This syntax should look familiar from our discussions on how to define traits in Chapter 10. Next comes some new syntax: Listing 18-4 defines a struct named Screen that holds a vector named components. This vector is of type Box<dyn Draw>, which is a trait object; it’s a stand-in for any type inside a Box that implements the Draw trait.": {
    "_translate": "这种语法应该让你想起我们在第 10 章讨论的如何定义特质的内容。接下来是一些新的语法：<code>Screen</code> 结构体定义在列表 18-4 中，它持有一个名为 <code>components</code> 的向量。这个向量的类型是 <code>Box&lt;dyn Draw&gt;</code>，这是一个特质对象；它是 <code>Box</code> 内部实现 <code>Draw</code> 特质的任何类型的占位符。",
    "_note": ""
  },
  "On the Screen struct, we’ll define a method named run that will call the draw method on each of its components, as shown in Listing 18-5:": {
    "_translate": "在 <code>Screen</code> 结构体上，我们将定义一个名为 <code>run</code> 的方法，该方法将调用每个 <code>components</code> 的 <code>draw</code> 方法，如清单 18-5 所示：",
    "_note": ""
  },
  "This works differently from defining a struct that uses a generic type parameter with trait bounds. A generic type parameter can only be substituted with one concrete type at a time, whereas trait objects allow for multiple concrete types to fill in for the trait object at runtime. For example, we could have defined the Screen struct using a generic type and a trait bound as in Listing 18-6:": {
    "_translate": "这与定义使用带有特征约束的泛型类型参数的结构体不同。泛型类型参数一次只能被一个具体类型替代，而特征对象允许在运行时用多个具体类型填充特征对象。例如，我们可以使用泛型类型和特征约束来定义<code>Screen</code>结构体，如清单18-6所示：",
    "_note": ""
  },
  "This restricts us to a Screen instance that has a list of components all of type Button or all of type TextField. If you’ll only ever have homogeneous collections, using generics and trait bounds is preferable because the definitions will be monomorphized at compile time to use the concrete types.": {
    "_translate": "这将我们限制在一个 <code>Screen</code> 实例中，该实例包含一个所有类型为 <code>Button</code> 或所有类型为 <code>TextField</code> 的组件列表。如果你只会拥有同质集合，使用泛型和特质边界是更可取的，因为定义将在编译时被单态化以使用具体的类型。",
    "_note": ""
  },
  "Implementing the Trait": {
    "_translate": "<a class=\"header\" href=\"#implementing-the-trait\">实现 Trait</a>",
    "_note": ""
  },
  "On the other hand, with the method using trait objects, one Screen instance can hold a Vec<T> that contains a Box<Button> as well as a Box<TextField>. Let’s look at how this works, and then we’ll talk about the runtime performance implications.": {
    "_translate": "另一方面，使用特质对象的方法，一个 <code>Screen</code> 实例 可以持有一个包含 <code>Box<Button></code> 以及 <code>Box<TextField></code> 的 <code>Vec<T></code>。让我们看看这是如何工作的，然后我们将讨论运行时性能影响。",
    "_note": ""
  },
  "Now we’ll add some types that implement the Draw trait. We’ll provide the Button type. Again, actually implementing a GUI library is beyond the scope of this book, so the draw method won’t have any useful implementation in its body. To imagine what the implementation might look like, a Button struct might have fields for width, height, and label, as shown in Listing 18-7:": {
    "_translate": "现在我们将添加一些实现<code>Draw</code>特性的类型。我们将提供<code>Button</code>类型。同样，实际实现一个GUI库超出了本书的范围，因此<code>draw</code>方法在其主体中不会有任何有用的实现。想象一下实现可能的样子，一个<code>Button</code>结构体可能有<code>width</code>、<code>height</code>和<code>label</code>字段，如清单18-7所示：",
    "_note": ""
  },
  "If someone using our library decides to implement a SelectBox struct that has width, height, and options fields, they implement the Draw trait on the SelectBox type as well, as shown in Listing 18-8:": {
    "_translate": "如果有人使用我们的库决定实现一个 <code>SelectBox</code> 结构体，该结构体具有 <code>width</code>、<code>height</code> 和 <code>options</code> 字段，他们还需要在 <code>SelectBox</code> 类型上实现 <code>Draw</code> 特性，如清单 18-8 所示：",
    "_note": ""
  },
  "The width, height, and label fields on Button will differ from the fields on other components; for example, a TextField type might have those same fields plus a placeholder field. Each of the types we want to draw on the screen will implement the Draw trait but will use different code in the draw method to define how to draw that particular type, as Button has here (without the actual GUI code, as mentioned). The Button type, for instance, might have an additional impl block containing methods related to what happens when a user clicks the button. These kinds of methods won’t apply to types like TextField.": {
    "_translate": "<code>width</code>、<code>height</code> 和 <code>label</code> 字段在 <code>Button</code> 上会与其他组件的字段不同；例如，<code>TextField</code> 类型可能有相同的字段，外加一个 <code>placeholder</code> 字段。我们希望在屏幕上绘制的每种类型都会实现 <code>Draw</code> 特性，但在 <code>draw</code> 方法中会使用不同的代码来定义如何绘制该特定类型，就像 <code>Button</code> 在这里所做的那样（不包括实际的 GUI 代码，如前所述）。例如，<code>Button</code> 类型可能有一个额外的 <code>impl</code> 块，包含与用户点击按钮时发生的情况相关的方法。这类方法不适用于 <code>TextField</code> 等类型。",
    "_note": ""
  },
  "When we wrote the library, we didn’t know that someone might add the SelectBox type, but our Screen implementation was able to operate on the new type and draw it because SelectBox implements the Draw trait, which means it implements the draw method.": {
    "_translate": "当我们编写库时，我们并不知道有人可能会添加<code>SelectBox</code>类型，但我们的<code>Screen</code>实现能够操作新类型并绘制它，因为<code>SelectBox</code>实现了<code>Draw</code> trait，这意味着它实现了<code>draw</code>方法。",
    "_note": ""
  },
  "Our library’s user can now write their main function to create a Screen instance. To the Screen instance, they can add a SelectBox and a Button by putting each in a Box<T> to become a trait object. They can then call the run method on the Screen instance, which will call draw on each of the components. Listing 18-9 shows this implementation:": {
    "_translate": "我们的库用户现在可以编写他们的 <code>main</code> 函数来创建一个 <code>Screen</code> 实例。向 <code>Screen</code> 实例中，他们可以通过将每个组件放入 <code>Box&lt;T&gt;</code> 中来添加一个 <code>SelectBox</code> 和一个 <code>Button</code>，从而成为特征对象。然后，他们可以在 <code>Screen</code> 实例上调用 <code>run</code> 方法，该方法将调用每个组件的 <code>draw</code> 方法。清单 18-9 显示了此实现：",
    "_note": ""
  },
  "The advantage of using trait objects and Rust’s type system to write code similar to code using duck typing is that we never have to check whether a value implements a particular method at runtime or worry about getting errors if a value doesn’t implement a method but we call it anyway. Rust won’t compile our code if the values don’t implement the traits that the trait objects need.": {
    "_translate": "使用 trait 对象和 Rust 的类型系统编写类似于使用鸭子类型编写的代码的优势在于，我们永远不必在运行时检查某个值是否实现了特定方法，也不必担心如果某个值没有实现某个方法但仍然调用它时会出错。如果值没有实现 trait 对象所需的 trait，Rust 不会编译我们的代码。",
    "_note": ""
  },
  "This concept—of being concerned only with the messages a value responds to rather than the value’s concrete type—is similar to the concept of duck typing in dynamically typed languages: if it walks like a duck and quacks like a duck, then it must be a duck! In the implementation of run on Screen in Listing 18-5, run doesn’t need to know what the concrete type of each component is. It doesn’t check whether a component is an instance of a Button or a SelectBox, it just calls the draw method on the component. By specifying Box<dyn Draw> as the type of the values in the components vector, we’ve defined Screen to need values that we can call the draw method on.": {
    "_translate": "这个概念——只关心值响应的消息而不是值的具体类型——类似于动态类型语言中的<em>鸭子类型</em>概念：如果它像鸭子一样走路，像鸭子一样叫，那么它一定是鸭子！在清单 18-5 中 <code>Screen</code> 上的 <code>run</code> 实现中，<code>run</code> 不需要知道每个组件的具体类型。它不会检查组件是否是 <code>Button</code> 或 <code>SelectBox</code> 的实例，它只是调用组件上的 <code>draw</code> 方法。通过将 <code>components</code> 向量中的值类型指定为 <code>Box&lt;dyn Draw&gt;</code>，我们定义了 <code>Screen</code> 需要我们可以调用 <code>draw</code> 方法的值。",
    "_note": ""
  },
  "For example, Listing 18-10 shows what happens if we try to create a Screen with a String as a component:": {
    "_translate": "例如，清单 18-10 显示了如果我们尝试使用 <code>String</code> 作为组件创建 <code>Screen</code> 会发生什么：",
    "_note": ""
  },
  "We’ll get this error because String doesn’t implement the Draw trait:": {
    "_translate": "我们将因为 <code>String</code> 没有实现 <code>Draw</code> 特性而收到此错误：",
    "_note": ""
  },
  "Trait Objects Perform Dynamic Dispatch": {
    "_translate": "<a class=\"header\" href=\"#trait-objects-perform-dynamic-dispatch\">Trait 对象执行动态分发</a>",
    "_note": ""
  },
  "This error lets us know that either we’re passing something to Screen we didn’t mean to pass and so should pass a different type or we should implement Draw on String so that Screen is able to call draw on it.": {
    "_translate": "这个错误告诉我们，要么我们传递给<code>Screen</code>的内容不是我们本意要传递的，因此应该传递不同的类型，要么我们应该在<code>String</code>上实现<code>Draw</code>，以便<code>Screen</code>能够调用其<code>draw</code>方法。",
    "_note": ""
  },
  "When we use trait objects, Rust must use dynamic dispatch. The compiler doesn’t know all the types that might be used with the code that’s using trait objects, so it doesn’t know which method implemented on which type to call. Instead, at runtime, Rust uses the pointers inside the trait object to know which method to call. This lookup incurs a runtime cost that doesn’t occur with static dispatch. Dynamic dispatch also prevents the compiler from choosing to inline a method’s code, which in turn prevents some optimizations. However, we did get extra flexibility in the code that we wrote in Listing 18-5 and were able to support in Listing 18-9, so it’s a trade-off to consider.": {
    "_translate": "当我们使用特质对象时，Rust 必须使用动态分发。编译器不知道所有可能与使用特质对象的代码一起使用的类型，因此它不知道要调用哪个类型上实现的方法。相反，在运行时，Rust 使用特质对象内部的指针来确定要调用的方法。这种查找会产生运行时成本，而静态分发则不会发生这种情况。动态分发还阻止编译器选择内联方法的代码，这反过来又阻止了一些优化。然而，我们在示例 18-5 中编写的代码确实获得了额外的灵活性，并且能够在示例 18-9 中支持，所以这是一个需要权衡的问题。",
    "_note": ""
  },
  "Recall in the “Performance of Code Using Generics” section in Chapter 10 our discussion on the monomorphization process performed by the compiler when we use trait bounds on generics: the compiler generates nongeneric implementations of functions and methods for each concrete type that we use in place of a generic type parameter. The code that results from monomorphization is doing static dispatch, which is when the compiler knows what method you’re calling at compile time. This is opposed to dynamic dispatch, which is when the compiler can’t tell at compile time which method you’re calling. In dynamic dispatch cases, the compiler emits code that at runtime will figure out which method to call.": {
    "_translate": "回忆在第 10 章 <a href=\"ch10-01-syntax.html#performance-of-code-using-generics\">“使用泛型的代码性能”</a><!-- ignore --> 部分我们关于编译器在我们对泛型使用特质边界时执行的单态化过程的讨论：编译器为每个我们用作泛型类型参数的具体类型生成非泛型的函数和方法实现。单态化生成的代码执行的是 <em>静态分发</em>，即编译器在编译时就知道你调用的是哪个方法。这与 <em>动态分发</em> 相对，即编译器在编译时无法确定你调用的是哪个方法。在动态分发的情况下，编译器会生成在运行时确定调用哪个方法的代码。",
    "_note": ""
  },
  "Using Trait Objects That Allow for Values of Different Types - The Rust Programming Language": {
    "_translate": "使用允许不同类型值的 Trait 对象 - 《Rust 编程语言》",
    "_note": ""
  },
  "When we use trait objects, Rust must use dynamic dispatch. The compiler doesn’t know all the types that might be used with the code that’s using trait objects, so it doesn’t know which method implemented on which type to call. Instead, at runtime, Rust uses the pointers inside the trait object to know which method to call. This lookup incurs a runtime cost that doesn’t occur with static dispatch. Dynamic dispatch also prevents the compiler from choosing to inline a method’s code, which in turn prevents some optimizations, and Rust has some rules about where you can and cannot use dynamic dispatch, called dyn compatibility. However, we did get extra flexibility in the code that we wrote in Listing 18-5 and were able to support in Listing 18-9, so it’s a trade-off to consider.": {
    "_translate": "当我们使用特质对象时，Rust 必须使用动态分发。编译器不知道可能与使用特质对象的代码一起使用的所有类型，因此它不知道要调用哪个类型上的哪个方法。相反，在运行时，Rust 使用特质对象内部的指针来确定要调用的方法。这种查找会产生运行时成本，而静态分发则不会发生这种情况。动态分发还阻止编译器选择内联方法的代码，这反过来又阻止了一些优化，Rust 有一些关于可以在哪里以及不能在哪里使用动态分发的规则，称为<a href=\"https://doc.rust-lang.org/reference/items/traits.html#dyn-compatibility\"><em>dyn 兼容性</em></a>。然而，我们在清单 18-5 中编写的代码确实获得了额外的灵活性，并且能够在清单 18-9 中支持，所以这是一个需要权衡的问题。",
    "_note": ""
  }
}