{
  "Building a Single-Threaded Web Server": {
    "_translate": "<a class=\"header\" href=\"#building-a-single-threaded-web-server\">构建单线程Web服务器</a>",
    "_note": ""
  },
  "We’ll start by getting a single-threaded web server working. Before we begin, let’s look at a quick overview of the protocols involved in building web servers. The details of these protocols are beyond the scope of this book, but a brief overview will give you the information you need.": {
    "_translate": "我们将从实现一个单线程的Web服务器开始。在我们开始之前，让我们快速了解一下构建Web服务器所涉及的协议。这些协议的详细信息超出了本书的范围，但简要概述将为您提供所需的信息。",
    "_note": ""
  },
  "The two main protocols involved in web servers are Hypertext Transfer Protocol (HTTP) and Transmission Control Protocol (TCP). Both protocols are request-response protocols, meaning a client initiates requests and a server listens to the requests and provides a response to the client. The contents of those requests and responses are defined by the protocols.": {
    "_translate": "涉及网络服务器的两个主要协议是<em>超文本传输协议</em> <em>(HTTP)</em>和<em>传输控制协议</em> <em>(TCP)</em>。这两种协议都是<em>请求-响应</em>协议，意味着一个<em>客户端</em>发起请求，而一个<em>服务器</em>监听这些请求并向客户端提供响应。这些请求和响应的内容由协议定义。",
    "_note": ""
  },
  "TCP is the lower-level protocol that describes the details of how information gets from one server to another but doesn’t specify what that information is. HTTP builds on top of TCP by defining the contents of the requests and responses. It’s technically possible to use HTTP with other protocols, but in the vast majority of cases, HTTP sends its data over TCP. We’ll work with the raw bytes of TCP and HTTP requests and responses.": {
    "_translate": "TCP 是描述信息如何从一个服务器传输到另一个服务器的底层协议，但不指定这些信息的具体内容。HTTP 在 TCP 的基础上通过定义请求和响应的内容来构建。虽然技术上可以将 HTTP 与其他协议一起使用，但在绝大多数情况下，HTTP 通过 TCP 发送数据。我们将处理 TCP 和 HTTP 请求及响应的原始字节。",
    "_note": ""
  },
  "Listening to the TCP Connection": {
    "_translate": "<a class=\"header\" href=\"#listening-to-the-tcp-connection\">监听 TCP 连接</a>",
    "_note": ""
  },
  "Our web server needs to listen to a TCP connection, so that’s the first part we’ll work on. The standard library offers a std::net module that lets us do this. Let’s make a new project in the usual fashion:": {
    "_translate": "我们的Web服务器需要监听一个TCP连接，所以这是我们首先要做的部分。标准库提供了一个<code>std::net</code>模块，让我们能够做到这一点。让我们像往常一样创建一个新项目：",
    "_note": ""
  },
  "Now enter the code in Listing 21-1 in src/main.rs to start. This code will listen at the local address 127.0.0.1:7878 for incoming TCP streams. When it gets an incoming stream, it will print Connection established!.": {
    "_translate": "现在在 <em>src/main.rs</em> 中输入清单 21-1 的代码以开始。此代码将在本地地址 <code>127.0.0.1:7878</code> 监听传入的 TCP 流。当它收到传入的流时，它将打印 <code>Connection established!</code>。",
    "_note": ""
  },
  "Using TcpListener, we can listen for TCP connections at the address 127.0.0.1:7878. In the address, the section before the colon is an IP address representing your computer (this is the same on every computer and doesn’t represent the authors’ computer specifically), and 7878 is the port. We’ve chosen this port for two reasons: HTTP isn’t normally accepted on this port so our server is unlikely to conflict with any other web server you might have running on your machine, and 7878 is rust typed on a telephone.": {
    "_translate": "使用<code>TcpListener</code>，我们可以在地址<code>127.0.0.1:7878</code>监听TCP连接。在地址中，冒号前的部分是表示您计算机的IP地址（这在每台计算机上都是相同的，并不特指作者的计算机），而<code>7878</code>是端口。我们选择这个端口有两个原因：HTTP通常不接受这个端口，因此我们的服务器不太可能与您机器上可能运行的任何其他Web服务器冲突，而且7878是在电话上输入的<em>rust</em>。",
    "_note": ""
  },
  "The bind function in this scenario works like the new function in that it will return a new TcpListener instance. The function is called bind because, in networking, connecting to a port to listen to is known as “binding to a port.”": {
    "_translate": "在这个场景中，<code>bind</code> 函数的作用类似于 <code>new</code> 函数，它将返回一个新的 <code>TcpListener</code> 实例。该函数被称为 <code>bind</code>，因为在网络中，连接到端口以监听的行为被称为“绑定到端口”。",
    "_note": ""
  },
  "The bind function returns a Result<T, E>, which indicates that it’s possible for binding to fail. For example, connecting to port 80 requires administrator privileges (nonadministrators can listen only on ports higher than 1023), so if we tried to connect to port 80 without being an administrator, binding wouldn’t work. Binding also wouldn’t work, for example, if we ran two instances of our program and so had two programs listening to the same port. Because we’re writing a basic server just for learning purposes, we won’t worry about handling these kinds of errors; instead, we use unwrap to stop the program if errors happen.": {
    "_translate": "<code>bind</code> 函数返回一个 <code>Result&lt;T, E&gt;</code>，这表明绑定可能会失败。例如，连接到 80 端口需要管理员权限（非管理员只能监听 1023 以上的端口），因此如果我们不是管理员却尝试连接到 80 端口，绑定将无法成功。同样，如果我们运行了程序的两个实例，导致两个程序监听同一个端口，绑定也无法成功。因为我们编写的是一个仅供学习的基本服务器，所以我们不会担心处理这些错误；相反，我们使用 <code>unwrap</code> 在发生错误时停止程序。",
    "_note": ""
  },
  "For now, our handling of the stream consists of calling unwrap to terminate our program if the stream has any errors; if there aren’t any errors, the program prints a message. We’ll add more functionality for the success case in the next listing. The reason we might receive errors from the incoming method when a client connects to the server is that we’re not actually iterating over connections. Instead, we’re iterating over connection attempts. The connection might not be successful for a number of reasons, many of them operating system specific. For example, many operating systems have a limit to the number of simultaneous open connections they can support; new connection attempts beyond that number will produce an error until some of the open connections are closed.": {
    "_translate": "目前，我们对流的处理仅限于调用<code>unwrap</code>来终止程序，如果流中出现任何错误；如果没有错误，程序将打印一条消息。我们将在下一个示例中为成功情况添加更多功能。当客户端连接到服务器时，我们可能会从<code>incoming</code>方法收到错误的原因是，我们实际上并不是在遍历连接。相反，我们是在遍历<em>连接尝试</em>。连接可能因多种原因而不成功，其中许多原因与操作系统有关。例如，许多操作系统对它们可以支持的同时打开的连接数量有限制；超过该数量的新连接尝试将在某些打开的连接关闭之前产生错误。",
    "_note": ""
  },
  "The incoming method on TcpListener returns an iterator that gives us a sequence of streams (more specifically, streams of type TcpStream). A single stream represents an open connection between the client and the server. A connection is the name for the full request and response process in which a client connects to the server, the server generates a response, and the server closes the connection. As such, we will read from the TcpStream to see what the client sent and then write our response to the stream to send data back to the client. Overall, this for loop will process each connection in turn and produce a series of streams for us to handle.": {
    "_translate": "<code>TcpListener</code> 上的 <code>incoming</code> 方法返回一个迭代器，该迭代器为我们提供了一序列的流（更具体地说，是 <code>TcpStream</code> 类型的流）。单个 <em>流</em> 表示客户端和服务器之间的一个开放连接。<em>连接</em> 是指客户端连接到服务器、服务器生成响应并关闭连接的整个请求和响应过程。因此，我们将从 <code>TcpStream</code> 中读取以查看客户端发送的内容，然后将我们的响应写入流中以将数据发送回客户端。总体而言，这个 <code>for</code> 循环将依次处理每个连接，并为我们生成一系列需要处理的流。",
    "_note": ""
  },
  "Sometimes, you’ll see multiple messages printed for one browser request; the reason might be that the browser is making a request for the page as well as a request for other resources, like the favicon.ico icon that appears in the browser tab.": {
    "_translate": "有时，您会看到一个浏览器请求打印多条消息；原因可能是浏览器正在请求页面以及像 <em>favicon.ico</em> 这样的其他资源，这些资源会出现在浏览器标签中。",
    "_note": ""
  },
  "Let’s try running this code! Invoke cargo run in the terminal and then load 127.0.0.1:7878 in a web browser. The browser should show an error message like “Connection reset,” because the server isn’t currently sending back any data. But when you look at your terminal, you should see several messages that were printed when the browser connected to the server!": {
    "_translate": "让我们尝试运行这段代码！在终端中调用<code>cargo run</code>，然后在网页浏览器中加载<em>127.0.0.1:7878</em>。浏览器应该显示一个错误消息，如“连接重置”，因为服务器当前没有发送任何数据。但当你查看终端时，你应该会看到浏览器连接到服务器时打印的几条消息！",
    "_note": ""
  },
  "It could also be that the browser is trying to connect to the server multiple times because the server isn’t responding with any data. When stream goes out of scope and is dropped at the end of the loop, the connection is closed as part of the drop implementation. Browsers sometimes deal with closed connections by retrying, because the problem might be temporary. The important factor is that we’ve successfully gotten a handle to a TCP connection!": {
    "_translate": "这也可能是浏览器尝试多次连接服务器，因为服务器没有响应任何数据。当 <code>stream</code> 在循环结束时超出作用范围并被丢弃时，连接作为 <code>drop</code> 实现的一部分被关闭。浏览器有时会通过重试来处理关闭的连接，因为问题可能是暂时的。重要的是，我们已经成功地获取了一个 TCP 连接的句柄！",
    "_note": ""
  },
  "Reading the Request": {
    "_translate": "<a class=\"header\" href=\"#reading-the-request\">读取请求</a>",
    "_note": ""
  },
  "Let’s implement the functionality to read the request from the browser! To separate the concerns of first getting a connection and then taking some action with the connection, we’ll start a new function for processing connections. In this new handle_connection function, we’ll read data from the TCP stream and print it so we can see the data being sent from the browser. Change the code to look like Listing 21-2.": {
    "_translate": "让我们实现从浏览器读取请求的功能！为了将首先获取连接和然后对连接采取某些行动的关注点分开，我们将开始一个用于处理连接的新函数。在这个新的<code>handle_connection</code>函数中，我们将从TCP流中读取数据并打印出来，这样我们就可以看到从浏览器发送的数据。将代码更改为如清单21-2所示。",
    "_note": ""
  },
  "Remember to stop the program by pressing ctrl-c when you’re done running a particular version of the code. Then restart the program by invoking the cargo run command after you’ve made each set of code changes to make sure you’re running the newest code.": {
    "_translate": "记住，在运行特定版本的代码完成后，通过按 <kbd>ctrl</kbd>-<kbd>c</kbd> 停止程序。然后在每次进行代码更改后，通过调用 <code>cargo run</code> 命令重新启动程序，以确保运行的是最新的代码。",
    "_note": ""
  },
  "We bring std::io::prelude and std::io::BufReader into scope to get access to traits and types that let us read from and write to the stream. In the for loop in the main function, instead of printing a message that says we made a connection, we now call the new handle_connection function and pass the stream to it.": {
    "_translate": "我们引入 <code>std::io::prelude</code> 和 <code>std::io::BufReader</code> 以获得可以让我们从流中读取和写入的特质和类型。在 <code>main</code> 函数的 <code>for</code> 循环中，我们不再打印一条消息说我们建立了一个连接，而是调用新的 <code>handle_connection</code> 函数并将 <code>stream</code> 传递给它。",
    "_note": ""
  },
  "In the handle_connection function, we create a new BufReader instance that wraps a reference to the stream. BufReader adds buffering by managing calls to the std::io::Read trait methods for us.": {
    "_translate": "在 <code>handle_connection</code> 函数中，我们创建了一个新的 <code>BufReader</code> 实例，该实例包装了对 <code>stream</code> 的引用。 <code>BufReader</code> 通过为我们管理对 <code>std::io::Read</code> 特性方法的调用，增加了缓冲。",
    "_note": ""
  },
  "We create a variable named http_request to collect the lines of the request the browser sends to our server. We indicate that we want to collect these lines in a vector by adding the Vec<_> type annotation.": {
    "_translate": "我们创建一个名为<code>http_request</code>的变量来收集浏览器发送到我们服务器的请求行。我们通过添加<code>Vec&lt;_&gt;</code>类型注解来表示我们希望将这些行收集到一个向量中。",
    "_note": ""
  },
  "The browser signals the end of an HTTP request by sending two newline characters in a row, so to get one request from the stream, we take lines until we get a line that is the empty string. Once we’ve collected the lines into the vector, we’re printing them out using pretty debug formatting so we can take a look at the instructions the web browser is sending to our server.": {
    "_translate": "浏览器通过发送两个连续的换行符来表示HTTP请求的结束，因此为了从流中获取一个请求，我们接收行直到我们接收到一个空字符串的行。一旦我们将这些行收集到向量中，我们就会使用漂亮的调试格式打印它们，这样我们就可以查看网页浏览器发送给我们的服务器的指令。",
    "_note": ""
  },
  "BufReader implements the std::io::BufRead trait, which provides the lines method. The lines method returns an iterator of Result<String, std::io::Error> by splitting the stream of data whenever it sees a newline byte. To get each String, we map and unwrap each Result. The Result might be an error if the data isn’t valid UTF-8 or if there was a problem reading from the stream. Again, a production program should handle these errors more gracefully, but we’re choosing to stop the program in the error case for simplicity.": {
    "_translate": "<code>BufReader</code> 实现了 <code>std::io::BufRead</code> 特性，该特性提供了 <code>lines</code> 方法。<code>lines</code> 方法通过在每次看到换行符时分割数据流，返回一个 <code>Result&lt;String, std::io::Error&gt;</code> 的迭代器。为了获取每个 <code>String</code>，我们映射并 <code>unwrap</code> 每个 <code>Result</code>。如果数据不是有效的 UTF-8 或者从流中读取时出现问题，<code>Result</code> 可能会是一个错误。再次强调，生产程序应该更优雅地处理这些错误，但为了简单起见，我们选择在错误情况下停止程序。",
    "_note": ""
  },
  "Let’s try this code! Start the program and make a request in a web browser again. Note that we’ll still get an error page in the browser, but our program’s output in the terminal will now look similar to this:": {
    "_translate": "让我们尝试这段代码！启动程序并在网页浏览器中再次发出请求。请注意，我们仍然会在浏览器中看到错误页面，但程序在终端的输出现在将类似于以下内容：",
    "_note": ""
  },
  "Let’s break down this request data to understand what the browser is asking of our program.": {
    "_translate": "让我们分解这个请求数据，以了解浏览器向我们的程序提出了什么请求。",
    "_note": ""
  },
  "Depending on your browser, you might get slightly different output. Now that we’re printing the request data, we can see why we get multiple connections from one browser request by looking at the path after GET in the first line of the request. If the repeated connections are all requesting /, we know the browser is trying to fetch / repeatedly because it’s not getting a response from our program.": {
    "_translate": "根据您的浏览器，您可能会得到略有不同的输出。现在我们打印了请求数据，可以通过查看请求第一行 <code>GET</code> 后的路径来了解为什么从一个浏览器请求中会收到多次连接。如果重复的连接都在请求 <em>/</em>，我们知道浏览器是因为没有从我们的程序中得到响应而反复尝试获取 <em>/</em>。",
    "_note": ""
  },
  "HTTP is a text-based protocol, and a request takes this format:": {
    "_translate": "HTTP 是一种基于文本的协议，请求的格式如下：",
    "_note": ""
  },
  "A Closer Look at an HTTP Request": {
    "_translate": "<a class=\"header\" href=\"#a-closer-look-at-an-http-request\">深入研究 HTTP 请求</a>",
    "_note": ""
  },
  "The first line is the request line that holds information about what the client is requesting. The first part of the request line indicates the method being used, such as GET or POST, which describes how the client is making this request. Our client used a GET request, which means it is asking for information.": {
    "_translate": "第一行是<em>请求行</em>，其中包含有关客户端请求的信息。请求行的第一部分指示所使用的<em>方法</em>，例如<code>GET</code>或<code>POST</code>，这描述了客户端如何进行此请求。我们的客户端使用了<code>GET</code>请求，这意味着它正在请求信息。",
    "_note": ""
  },
  "The next part of the request line is /, which indicates the Uniform Resource Identifier (URI) the client is requesting: a URI is almost, but not quite, the same as a Uniform Resource Locator (URL). The difference between URIs and URLs isn’t important for our purposes in this chapter, but the HTTP spec uses the term URI, so we can just mentally substitute URL for URI here.": {
    "_translate": "请求行的下一部分是<em>/</em>，这表示客户端请求的<em>统一资源标识符</em> <em>(URI)</em>：URI 几乎，但不完全是，与<em>统一资源定位符</em> <em>(URL)</em>相同。在本章中，URI 和 URL 之间的区别并不重要，但 HTTP 规范使用了 URI 这个术语，因此我们可以在这里将 URI 理解为 URL。",
    "_note": ""
  },
  "Looking at the request line data we received from running our program so far, we see that GET is the method, / is the request URI, and HTTP/1.1 is the version.": {
    "_translate": "查看到目前为止我们程序运行接收到的请求行数据，我们看到 <code>GET</code> 是方法，<em>/</em> 是请求URI，<code>HTTP/1.1</code> 是版本。",
    "_note": ""
  },
  "The last part is the HTTP version the client uses, and then the request line ends in a CRLF sequence. (CRLF stands for carriage return and line feed, which are terms from the typewriter days!) The CRLF sequence can also be written as \\r\\n, where \\r is a carriage return and \\n is a line feed. The CRLF sequence separates the request line from the rest of the request data. Note that when the CRLF is printed, we see a new line start rather than \\r\\n.": {
    "_translate": "最后一部分是客户端使用的HTTP版本，然后请求行以一个<em>CRLF序列</em>结束。 (CRLF代表<em>回车</em>和<em>换行</em>，这些术语源自打字机时代！) CRLF序列也可以写成<code>\\r\\n</code>，其中<code>\\r</code>是回车，<code>\\n</code>是换行。CRLF序列将请求行与请求的其余数据分隔开。请注意，当CRLF被打印时，我们看到的是新的一行开始而不是<code>\\r\\n</code>。",
    "_note": ""
  },
  "After the request line, the remaining lines starting from Host: onward are headers. GET requests have no body.": {
    "_translate": "在请求行之后，从 <code>Host:</code> 开始的剩余行是头部。<code>GET</code> 请求没有正文。",
    "_note": ""
  },
  "Try making a request from a different browser or asking for a different address, such as 127.0.0.1:7878/test, to see how the request data changes.": {
    "_translate": "尝试从不同的浏览器发出请求或请求不同的地址，例如 <em>127.0.0.1:7878/test</em>，以查看请求数据如何变化。",
    "_note": ""
  },
  "Now that we know what the browser is asking for, let’s send back some data!": {
    "_translate": "现在我们知道了浏览器在请求什么，让我们返回一些数据！",
    "_note": ""
  },
  "Writing a Response": {
    "_translate": "<a class=\"header\" href=\"#writing-a-response\">编写响应</a>",
    "_note": ""
  },
  "We’re going to implement sending data in response to a client request. Responses have the following format:": {
    "_translate": "我们将实现响应客户端请求发送数据。\n响应具有以下格式：",
    "_note": ""
  },
  "The first line is a status line that contains the HTTP version used in the response, a numeric status code that summarizes the result of the request, and a reason phrase that provides a text description of the status code. After the CRLF sequence are any headers, another CRLF sequence, and the body of the response.": {
    "_translate": "第一行是<em>状态行</em>，其中包含响应中使用的HTTP版本、一个总结请求结果的数字状态码，以及提供状态码文本描述的原因短语。在CRLF序列之后是任何头部，另一个CRLF序列，以及响应的主体。",
    "_note": ""
  },
  "Here is an example response that uses HTTP version 1.1, has a status code of 200, an OK reason phrase, no headers, and no body:": {
    "_translate": "这里是一个使用 HTTP 版本 1.1 的示例响应，状态码为 200，原因短语为 OK，没有头部，也没有正文：",
    "_note": ""
  },
  "The status code 200 is the standard success response. The text is a tiny successful HTTP response. Let’s write this to the stream as our response to a successful request! From the handle_connection function, remove the println! that was printing the request data and replace it with the code in Listing 21-3.": {
    "_translate": "状态码 200 是标准的成功响应。文本是一个小小的成功 HTTP 响应。让我们将此写入流作为我们对成功请求的响应！从 <code>handle_connection</code> 函数中，移除打印请求数据的 <code>println!</code>，并用列表 21-3 中的代码替换它。",
    "_note": ""
  },
  "The first new line defines the response variable that holds the success message’s data. Then we call as_bytes on our response to convert the string data to bytes. The write_all method on stream takes a &[u8] and sends those bytes directly down the connection. Because the write_all operation could fail, we use unwrap on any error result as before. Again, in a real application you would add error handling here.": {
    "_translate": "第一行新代码定义了持有成功消息数据的<code>response</code>变量。然后我们对<code>response</code>调用<code>as_bytes</code>，将字符串数据转换为字节。<code>stream</code>上的<code>write_all</code>方法接受一个<code>&amp;[u8]</code>，并将这些字节直接发送到连接中。因为<code>write_all</code>操作可能会失败，我们像之前一样对任何错误结果使用<code>unwrap</code>。同样，在实际应用中，您会在这里添加错误处理。",
    "_note": ""
  },
  "Returning Real HTML": {
    "_translate": "<a class=\"header\" href=\"#returning-real-html\">返回真实的 HTML</a>",
    "_note": ""
  },
  "With these changes, let’s run our code and make a request. We’re no longer printing any data to the terminal, so we won’t see any output other than the output from Cargo. When you load 127.0.0.1:7878 in a web browser, you should get a blank page instead of an error. You’ve just hand-coded receiving an HTTP request and sending a response!": {
    "_translate": "有了这些更改，让我们运行代码并发出请求。我们不再将任何数据打印到终端，因此除了 Cargo 的输出外，我们不会看到任何其他输出。当您在网页浏览器中加载 <em>127.0.0.1:7878</em> 时，您应该会得到一个空白页面而不是错误。您刚刚手动编写了接收 HTTP 请求和发送响应的代码！",
    "_note": ""
  },
  "Let’s implement the functionality for returning more than a blank page. Create the new file hello.html in the root of your project directory, not in the src directory. You can input any HTML you want; Listing 21-4 shows one possibility.": {
    "_translate": "让我们实现返回不仅仅是空白页面的功能。在你的项目目录的根目录下，而不是在 <em>src</em> 目录中，创建新文件 <em>hello.html</em>。你可以输入任何你想要的 HTML；清单 21-4 显示了一种可能性。",
    "_note": ""
  },
  "This is a minimal HTML5 document with a heading and some text. To return this from the server when a request is received, we’ll modify handle_connection as shown in Listing 21-5 to read the HTML file, add it to the response as a body, and send it.": {
    "_translate": "这是一个包含标题和一些文本的最小 HTML5 文档。为了在收到请求时从服务器返回此内容，我们将按照清单 21-5 所示修改 <code>handle_connection</code> 以读取 HTML 文件，将其作为响应的正文添加，并发送它。",
    "_note": ""
  },
  "We’ve added fs to the use statement to bring the standard library’s filesystem module into scope. The code for reading the contents of a file to a string should look familiar; we used it in Chapter 12 when we read the contents of a file for our I/O project in Listing 12-4.": {
    "_translate": "我们已经将 <code>fs</code> 添加到 <code>use</code> 语句中，以将标准库的文件系统模块引入作用域。读取文件内容到字符串的代码应该看起来很熟悉；我们在第 12 章中读取文件内容用于我们的 I/O 项目时使用过它，如列表 12-4 所示。",
    "_note": ""
  },
  "Next, we use format! to add the file’s contents as the body of the success response. To ensure a valid HTTP response, we add the Content-Length header which is set to the size of our response body, in this case the size of hello.html.": {
    "_translate": "接下来，我们使用<code>format!</code>将文件的内容作为成功响应的主体。为了确保有效的HTTP响应，我们添加了<code>Content-Length</code>头，该头设置为响应主体的大小，在这种情况下是<code>hello.html</code>的大小。",
    "_note": ""
  },
  "Run this code with cargo run and load 127.0.0.1:7878 in your browser; you should see your HTML rendered!": {
    "_translate": "使用 <code>cargo run</code> 运行此代码并在浏览器中加载 <em>127.0.0.1:7878</em>；你应该看到你的 HTML 被渲染！",
    "_note": ""
  },
  "Validating the Request and Selectively Responding": {
    "_translate": "<a class=\"header\" href=\"#validating-the-request-and-selectively-responding\">验证请求并选择性响应</a>",
    "_note": ""
  },
  "Currently, we’re ignoring the request data in http_request and just sending back the contents of the HTML file unconditionally. That means if you try requesting 127.0.0.1:7878/something-else in your browser, you’ll still get back this same HTML response. At the moment, our server is very limited and does not do what most web servers do. We want to customize our responses depending on the request and only send back the HTML file for a well-formed request to /.": {
    "_translate": "目前，我们忽略了 <code>http_request</code> 中的请求数据，只是无条件地返回 HTML 文件的内容。这意味着如果你尝试在浏览器中请求 <em>127.0.0.1:7878/something-else</em>，你仍然会收到相同的 HTML 响应。目前，我们的服务器非常有限，没有像大多数 Web 服务器那样工作。我们希望根据请求自定义响应，并且只对格式良好的请求 <em>/</em> 返回 HTML 文件。",
    "_note": ""
  },
  "Right now, our web server will return the HTML in the file no matter what the client requested. Let’s add functionality to check that the browser is requesting / before returning the HTML file and return an error if the browser requests anything else. For this we need to modify handle_connection, as shown in Listing 21-6. This new code checks the content of the request received against what we know a request for / looks like and adds if and else blocks to treat requests differently.": {
    "_translate": "目前，我们的Web服务器无论客户端请求什么，都会返回文件中的HTML。让我们添加功能，检查浏览器是否请求了<em>/</em>，然后再返回HTML文件，如果浏览器请求了其他内容，则返回错误。为此，我们需要修改<code>handle_connection</code>，如清单21-6所示。这段新代码会检查收到的请求内容是否与我们已知的请求<em>/</em>的内容相符，并添加<code>if</code>和<code>else</code>块来不同地处理请求。",
    "_note": ""
  },
  "Next, we check the request_line to see if it equals the request line of a GET request to the / path. If it does, the if block returns the contents of our HTML file.": {
    "_translate": "接下来，我们检查<code>request_line</code>，看它是否等于对<em>/</em>路径的GET请求的请求行。如果相等，<code>if</code>块将返回我们的HTML文件的内容。",
    "_note": ""
  },
  "We’re only going to be looking at the first line of the HTTP request, so rather than reading the entire request into a vector, we’re calling next to get the first item from the iterator. The first unwrap takes care of the Option and stops the program if the iterator has no items. The second unwrap handles the Result and has the same effect as the unwrap that was in the map added in Listing 21-2.": {
    "_translate": "我们只会查看HTTP请求的第一行，因此我们调用<code>next</code>来从迭代器中获取第一项，而不是将整个请求读入一个向量。第一个<code>unwrap</code>处理<code>Option</code>并在迭代器没有项时停止程序。第二个<code>unwrap</code>处理<code>Result</code>，其效果与在清单21-2中添加的<code>map</code>中的<code>unwrap</code>相同。",
    "_note": ""
  },
  "If the request_line does not equal the GET request to the / path, it means we’ve received some other request. We’ll add code to the else block in a moment to respond to all other requests.": {
    "_translate": "如果 <code>request_line</code> <em>不</em> 等于对 <em>/</em> 路径的 GET 请求，这意味着我们收到了其他请求。我们将在 <code>else</code> 块中添加代码以响应所有其他请求。",
    "_note": ""
  },
  "Run this code now and request 127.0.0.1:7878; you should get the HTML in hello.html. If you make any other request, such as 127.0.0.1:7878/something-else, you’ll get a connection error like those you saw when running the code in Listing 21-1 and Listing 21-2.": {
    "_translate": "现在运行此代码并请求<em>127.0.0.1:7878</em>；你应该得到<em>hello.html</em>中的HTML。如果你发出任何其他请求，例如<em>127.0.0.1:7878/something-else</em>，你将收到类似于在清单21-1和清单21-2中运行代码时看到的连接错误。",
    "_note": ""
  },
  "Now let’s add the code in Listing 21-7 to the else block to return a response with the status code 404, which signals that the content for the request was not found. We’ll also return some HTML for a page to render in the browser indicating the response to the end user.": {
    "_translate": "现在让我们在清单 21-7 中添加代码到 <code>else</code> 块中，以返回状态码为 404 的响应，这表示请求的内容未找到。我们还将返回一些 HTML，以便在浏览器中渲染一个页面，向最终用户显示响应。",
    "_note": ""
  },
  "Here, our response has a status line with status code 404 and the reason phrase NOT FOUND. The body of the response will be the HTML in the file 404.html. You’ll need to create a 404.html file next to hello.html for the error page; again feel free to use any HTML you want or use the example HTML in Listing 21-8.": {
    "_translate": "在这里，我们的响应有一个带有状态码 404 和原因短语 <code>NOT FOUND</code> 的状态行。响应的正文将是文件 <em>404.html</em> 中的 HTML。\n你需要在 <em>hello.html</em> 旁边创建一个 <em>404.html</em> 文件作为错误页面；同样，你可以使用任何你想要的 HTML，或者使用列表 21-8 中的示例 HTML。",
    "_note": ""
  },
  "A Touch of Refactoring": {
    "_translate": "<a class=\"header\" href=\"#a-touch-of-refactoring\">一点重构</a>",
    "_note": ""
  },
  "With these changes, run your server again. Requesting 127.0.0.1:7878 should return the contents of hello.html, and any other request, like 127.0.0.1:7878/foo, should return the error HTML from 404.html.": {
    "_translate": "有了这些更改，再次运行您的服务器。请求<em>127.0.0.1:7878</em>应该返回<em>hello.html</em>的内容，而任何其他请求，如<em>127.0.0.1:7878/foo</em>，应该返回来自<em>404.html</em>的错误HTML。",
    "_note": ""
  },
  "Now the if and else blocks only return the appropriate values for the status line and filename in a tuple; we then use destructuring to assign these two values to status_line and filename using a pattern in the let statement, as discussed in Chapter 19.": {
    "_translate": "现在 <code>if</code> 和 <code>else</code> 块只返回状态行和文件名的适当值的元组；然后我们使用解构将这两个值分配给 <code>status_line</code> 和 <code>filename</code>，使用 <code>let</code> 语句中的模式，如第 19 章所述。",
    "_note": ""
  },
  "At the moment the if and else blocks have a lot of repetition: they’re both reading files and writing the contents of the files to the stream. The only differences are the status line and the filename. Let’s make the code more concise by pulling out those differences into separate if and else lines that will assign the values of the status line and the filename to variables; we can then use those variables unconditionally in the code to read the file and write the response. Listing 21-9 shows the resulting code after replacing the large if and else blocks.": {
    "_translate": "目前，<code>if</code> 和 <code>else</code> 块中有大量的重复：它们都在读取文件并将文件内容写入流中。唯一的区别是状态行和文件名。让我们通过将这些差异提取到单独的 <code>if</code> 和 <code>else</code> 行中，将状态行和文件名的值分配给变量，从而使代码更加简洁；然后我们可以在代码中无条件地使用这些变量来读取文件并写入响应。列表 21-9 显示了替换大的 <code>if</code> 和 <code>else</code> 块后的代码。",
    "_note": ""
  },
  "Awesome! We now have a simple web server in approximately 40 lines of Rust code that responds to one request with a page of content and responds to all other requests with a 404 response.": {
    "_translate": "太棒了！我们现在有了一个大约40行Rust代码的简单Web服务器，它对一个请求响应一个页面内容，对所有其他请求响应404。",
    "_note": ""
  },
  "The previously duplicated code is now outside the if and else blocks and uses the status_line and filename variables. This makes it easier to see the difference between the two cases, and it means we have only one place to update the code if we want to change how the file reading and response writing work. The behavior of the code in Listing 21-9 will be the same as that in Listing 21-7.": {
    "_translate": "先前复制的代码现在位于 <code>if</code> 和 <code>else</code> 块之外，并使用了 <code>status_line</code> 和 <code>filename</code> 变量。这使得更容易看到两种情况之间的差异，并且如果我们想要更改文件读取和响应写入的方式，我们只需要在一个地方更新代码。列表 21-9 中的代码行为将与列表 21-7 中的相同。",
    "_note": ""
  },
  "Currently, our server runs in a single thread, meaning it can only serve one request at a time. Let’s examine how that can be a problem by simulating some slow requests. Then we’ll fix it so our server can handle multiple requests at once.": {
    "_translate": "目前，我们的服务器在单线程中运行，这意味着它一次只能处理一个请求。让我们通过模拟一些慢请求来 examine 这可能会如何成为一个问题。然后我们将修复它，使我们的服务器能够同时处理多个请求。",
    "_note": ""
  },
  "Building a Single-Threaded Web Server - The Rust Programming Language": {
    "_translate": "构建单线程 Web 服务器 - 《Rust 编程语言》",
    "_note": ""
  }
}